my_emacs/emacs.org
#+TITLE: Martins Emacs Start
#+OPTIONS: html-postamble:nil html-preamble:t tex:t
#+OPTIONS: toc:3 num:nil ^:nil creator:nil timestamp:nil
#+SETUPFILE: config/org/notes-style.org
* Introduction
  :PROPERTIES:
  :CUSTOM_ID: introduction
  :END:
  This is an attempt to migrate my .emacs file into a literate programming org
  version. The main reason is that I hope for better folding and organisation.

  The org-file sets the necessary export options for a nice but not chatty html export.

  Infos on the different packages and settings are in =LOGBOOK= drawers within each
  entry. Reminder: new ones are added via =C-c C-z=.

  The startup is divided into 4 files:
  - =init.el= which starts the org-babel magic
  - =emacs.org= this file which contains the most part
  - =local.el= which contains local or sensitive details
  - =custom.el= which contains everything from M-x customize

  The =init.el= file is where everything begins. It is loaded automatically by Emacs on
  startup, It prepares the repositories I use and the package system to load all packages
  the further startup depends on. Finally it set ups the highly useful =no-littering=
  package.

 I aim to use =use-package= as much as possible because I like the clean code and the fast
startup. Some files I use are not available on MELPA. Those are in a sub-directory of my
user directory creatively called “lisp”.

I borrowed a lot from other people’s files, but only recently started no note where things
come from.
* Basics
** Load the local file
    This file contains data that is eithersensitive so I don't want to share it and also
    everything system-dependent. Check the existence of such a file before loading so as
    not to cause errors.
#+BEGIN_SRC emacs-lisp
(let
((local-file (expand-file-name "local.el" user-emacs-directory)))
(when (file-exists-p local-file)
(load local-file 'noerror)))
#+END_SRC
** Move customizations into their own file
    Customizations go to a dedicated file. Check the existence of such a file before loading so as
    not to cause errors on a vanilla emacs installation.
   #+begin_src emacs-lisp
    (let
      ((customization-file (expand-file-name "custom.el" user-emacs-directory)))
    (when (file-exists-p customization-file)
      (setq custom-file customization-file)
      (load custom-file 'noerror)))
   #+end_src
** Set the default font and frame config
    :LOGBOOK:
    - Note taken on [2018-08-21 Di 08:50] \\
      default fontset added
    - Note taken on [2018-04-29 So 20:22]
      Fira Code ligatures don't seem to work
    - Note taken on [2018-04-23 Mo 11:55]
      Fira Code added
    :END:
    I like to see the full path of the buffer and no right fringe. The default fontset
    settings shall ensure that all unicode can be displayed. It's mainly there for the eye
    candy later. Finally inhibiting font cache compacting /should/ improve performance on
    Windows.
    #+begin_src emacs-lisp
      (setq default-frame-alist
            '(
              (fringe-mode (quote (1 . 1)) nil (fringe))
              (fringes-outside-margins nil t)
              (right-fringe . 0)
              (left-fringe)
              (left-fringe-width nil)
              (frame-resize-pixelwise t)
              (border-color . "black")
              (menu-bar-lines . 1)))

      (setq-default frame-title-format
                    (list '((buffer-file-name " %f"
                                              (dired-directory
                                               dired-directory
                                               (revert-buffer-function " %b"
                                                                       ("%b - Dir:  " default-directory)))))))
      (when (display-graphic-p)
        (set-fontset-font "fontset-default" nil
                          (font-spec :size 20 :name "Symbola")))

      (cond ((eq system-type 'windows-nt)
             (setq inhibit-compacting-font-caches t
                   w32-use-native-image-API t)))
    #+end_src
** Maximize by default
    #+begin_src emacs-lisp
    (add-hook 'window-setup-hook 'toggle-frame-maximized t)
    #+end_src
** Garbage-collect on focus-out, Emacs /should/ feel snappier.
    :LOGBOOK:
    - Note taken on [2018-04-15 So 12:49] \\
      From Manish Parashar
    :END:
    #+begin_src emacs-lisp
    (add-hook 'focus-out-hook #'garbage-collect)
    #+end_src
** Set coding system
    I use utf8-encoding everywhere
    #+begin_src emacs-lisp
    (prefer-coding-system       'utf-8)
    (set-default-coding-systems 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (setq default-buffer-file-coding-system 'utf-8)
    #+end_src
    Specify font for all unicode characters
    #+BEGIN_SRC emacs-lisp
      (when (member "Symbola" (font-family-list))
        (set-fontset-font t 'unicode "Symbola" nil 'prepend))
    #+END_SRC
** Theme
    :LOGBOOK:
    - Note taken on [2018-05-09 Mi 07:57] \\
      Switch to =use-package=
    - Note taken on [2018-04-23 Mo 15:51] \\
      Change to aurora theme
    - Note taken on [2018-04-15 So 12:49] \\
      From Manish Parashar
    :END:
    I switch themes regularly. Unused ones can simple be marked as disabled.

    From [[http://www.greghendershott.com/2017/02/emacs-themes.html][Emacs Themes]] some code to make switching easier
    #+begin_src emacs-lisp

      (defun ms/disable-all-themes ()
        (interactive)
        (mapc #'disable-theme custom-enabled-themes))

      (defun ms/load-theme-advice (f theme-id &optional no-confirm no-enable &rest args)
              "Enhances `load-theme' to disable enabled themes for a clean slate."
              (unless no-enable
                (ms/disable-all-themes))
              (prog1
                  (apply f theme-id no-confirm no-enable args)))

      (advice-add 'load-theme
                  :around
                  #'ms/load-theme-advice)
#+end_src
    =solarized-dark= with some customization:
    - make the modeline high contrast
    - make the fringe stand out from the background
    - use more italic
  #+begin_src emacs-lisp
    (use-package solarized-theme
      :demand t
      :disabled
      :config
      (set-face-attribute 'font-lock-constant-face nil :weight 'normal)
      (set-face-attribute 'font-lock-function-name-face nil :weight 'bold)
      (set-face-attribute 'font-lock-comment-face nil :italic t)
      (set-face-attribute 'font-lock-doc-face nil :italic t)
      (setq solarized-high-contrast-mode-line nil
            solarized-distinct-fringe-background t
            solarized-use-more-italic t
            solarized-use-less-bold nil
            solarized-distinct-doc-face t)
      (load-theme 'solarized-zenburn t))
    #+end_src

  =leuven= is nice for Org-Mode
 #+BEGIN_SRC emacs-lisp
   (use-package leuven-theme
     :demand t
     :disabled
     :config
     (setq leuven-scale-outline-headlines nil
           leuven-scale-org-agenda-structure nil)
     (load-theme 'leuven t))
  #+END_SRC

  =poet= is also nice but required changing the faces for =org-column= and =org-column-header= to be useful
 #+BEGIN_SRC emacs-lisp
   (use-package poet-theme
     :demand t
     :disabled
     :config
     (set-face-attribute 'default nil :family "monofur" :height 110)
     (set-face-attribute 'fixed-pitch nil :family "monofur")
     (set-face-attribute 'variable-pitch nil :family "Baskerville Old Face")
     (load-theme 'poet t))
  #+END_SRC

 =doom-nova= is my newest favorite but has issues with =org-bullets=. These have been
 resolved due to proper fontset settings.
    #+BEGIN_SRC emacs-lisp
      (use-package doom-themes
        :demand t
        :disabled
        :config
        (doom-themes-org-config)
        (doom-themes-visual-bell-config)
        (load-theme 'doom-solarized-dark t)
      )
    #+END_SRC
    Let's try =material= for a while
    #+begin_src emacs-lisp
      (use-package material-theme
        :demand t
        :disabled
        :config
        (load-theme 'material t))
    #+end_src

    Another choice is =sanityinc-tomorrow=
#+begin_src emacs-lisp
  (use-package color-theme-sanityinc-tomorrow
    :demand t
    :disabled
    :config
    (load-theme 'sanityinc-tomorrow-day t))
#+end_src
    Again a lighter theme =parchment=
    #+begin_src emacs-lisp
      (use-package parchment-theme
        :demand t
        :disabled
        :config
        (load-theme 'parchment t))
    #+end_src

    Here is  another nice dark theme
    #+begin_src emacs-lisp
      (use-package darkplus-theme
        :load-path "lisp"
        :demand t
        :disabled
        :config
        (load-theme 'darkplus t))
    #+end_src

Many people recommend the modus theme. Let's try it
#+begin_src emacs-lisp
  (use-package modus-operandi-theme
    :demand t
    :disabled t
    :custom
    (modus-operandi-theme-proportional-fonts t)
    (modus-operandi-theme-scale-headings t)
    :config
    (load-theme 'modus-operandi t))
#+end_src
I'm using =nord= now elsewhere so let's use it in Emacs as well
#+begin_src emacs-lisp
  (use-package nord-theme
 ; :demand t
  :config
  (load-theme 'nord t))
#+end_src
** Backup
    :LOGBOOK:
    - Note taken on [2018-04-29 So 20:40] \\
      Trying ideas from https://www.emacswiki.org/emacs/BackupDirectory
    :END:
I don't want to see trailing whitespace. Adding this as a general =before-save-hook= does the job
automatically upon save. Backups should be more than one and go in a dedicated directory
    #+begin_src emacs-lisp
      (use-package files
        :ensure nil
        :hook
        (before-save . delete-trailing-whitespace)
        :custom
        ;; backup settings
        (backup-by-copying t "don't clobber symlinks")
        (delete-old-versions t)
        (kept-new-versions 6)
        (kept-old-versions 2)
        (version-control t "use versioned backups")
        :config
        (setq confirm-kill-processes nil))
    #+end_src
* General configuration
** ACE-Windows
    :LOGBOOK:
    - Note taken on [2018-05-24 Do 21:22] \\
      Von https://www.suenkler.info/notes/emacs-config/
    :END:
    This package allows for easy window switching
    #+BEGIN_SRC emacs-lisp
    (use-package ace-window
    :ensure t
    :init
    (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
    '(aw-leading-char-face
    ((t (:inherit ace-jump-face-foreground :height 3.0)))))))
    #+END_SRC
** Aliases
    [2013-09-03 Di 23:45] I learned from https://sites.google.com/site/steveyegge2/effective-emacs  how to add
    aliases which seems handy. The first entry is just a sample to remind me of the syntax
    #+begin_src emacs-lisp
    (defalias 'qrr 'query-replace-regexp)
    #+end_src
