my_emacs/emacs.el
(let
((local-file (expand-file-name "local.el" user-emacs-directory)))
(when (file-exists-p local-file)
(load local-file 'noerror)))

(let
  ((customization-file (expand-file-name "custom.el" user-emacs-directory)))
(when (file-exists-p customization-file)
  (setq custom-file customization-file)
  (load custom-file 'noerror)))

(setq default-frame-alist
      '(
        (fringe-mode (quote (1 . 1)) nil (fringe))
        (fringes-outside-margins nil t)
        (right-fringe . 0)
        (left-fringe)
        (left-fringe-width nil)
        (frame-resize-pixelwise t)
        (border-color . "black")
        (menu-bar-lines . 1)))

(setq-default frame-title-format
              (list '((buffer-file-name " %f"
                                        (dired-directory
                                         dired-directory
                                         (revert-buffer-function " %b"
                                                                 ("%b - Dir:  " default-directory)))))))
(when (display-graphic-p)
  (set-fontset-font "fontset-default" nil
                    (font-spec :size 20 :name "Symbola")))

(cond ((eq system-type 'windows-nt)
       (setq inhibit-compacting-font-caches t
             w32-use-native-image-API t)))

(add-hook 'window-setup-hook 'toggle-frame-maximized t)

(add-hook 'focus-out-hook #'garbage-collect)

(prefer-coding-system       'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

(when (member "Symbola" (font-family-list))
  (set-fontset-font t 'unicode "Symbola" nil 'prepend))

(defun ms/disable-all-themes ()
  (interactive)
  (mapc #'disable-theme custom-enabled-themes))

(defun ms/load-theme-advice (f theme-id &optional no-confirm no-enable &rest args)
        "Enhances `load-theme' to disable enabled themes for a clean slate."
        (unless no-enable
          (ms/disable-all-themes))
        (prog1
            (apply f theme-id no-confirm no-enable args)))

(advice-add 'load-theme
            :around
            #'ms/load-theme-advice)

(use-package solarized-theme
  :demand t
  :disabled
  :config
  (set-face-attribute 'font-lock-constant-face nil :weight 'normal)
  (set-face-attribute 'font-lock-function-name-face nil :weight 'bold)
  (set-face-attribute 'font-lock-comment-face nil :italic t)
  (set-face-attribute 'font-lock-doc-face nil :italic t)
  (setq solarized-high-contrast-mode-line nil
        solarized-distinct-fringe-background t
        solarized-use-more-italic t
        solarized-use-less-bold nil
        solarized-distinct-doc-face t)
  (load-theme 'solarized-zenburn t))

(use-package leuven-theme
  :demand t
  :disabled
  :config
  (setq leuven-scale-outline-headlines nil
        leuven-scale-org-agenda-structure nil)
  (load-theme 'leuven t))

(use-package poet-theme
  :demand t
  :disabled
  :config
  (set-face-attribute 'default nil :family "monofur" :height 110)
  (set-face-attribute 'fixed-pitch nil :family "monofur")
  (set-face-attribute 'variable-pitch nil :family "Baskerville Old Face")
  (load-theme 'poet t))

(use-package doom-themes
  :demand t
  :disabled
  :config
  (doom-themes-org-config)
  (doom-themes-visual-bell-config)
  (load-theme 'doom-solarized-dark t)
)

(use-package material-theme
  :demand t
  :disabled
  :config
  (load-theme 'material t))

(use-package color-theme-sanityinc-tomorrow
  :demand t
  :disabled
  :config
  (load-theme 'sanityinc-tomorrow-day t))

(use-package parchment-theme
  :demand t
  :disabled
  :config
  (load-theme 'parchment t))

(use-package darkplus-theme
  :load-path "lisp"
  :demand t
  :disabled
  :config
  (load-theme 'darkplus t))

(use-package modus-operandi-theme
  :demand t
  :disabled t
  :custom
  (modus-operandi-theme-proportional-fonts t)
  (modus-operandi-theme-scale-headings t)
  :config
  (load-theme 'modus-operandi t))

(use-package nord-theme
; :demand t
 :config
 (load-theme 'nord t))

(use-package files
  :ensure nil
  :hook
  (before-save . delete-trailing-whitespace)
  :custom
  ;; backup settings
  (backup-by-copying t "don't clobber symlinks")
  (delete-old-versions t)
  (kept-new-versions 6)
  (kept-old-versions 2)
  (version-control t "use versioned backups")
  :config
  (setq confirm-kill-processes nil))

(use-package ace-window
:ensure t
:init
(progn
(global-set-key [remap other-window] 'ace-window)
(custom-set-faces
'(aw-leading-char-face
((t (:inherit ace-jump-face-foreground :height 3.0)))))))

(defalias 'qrr 'query-replace-regexp)

(when (window-system)
