my_emacs/emacs.org
** All the icons
:PROPERTIES:
:CREATED:  [2019-02-25 Mon 09:17]
:END:
Show icons in buffers
It seems I need =font-lock+.el= for it to work on Windows.
#+begin_src emacs-lisp
  (when (window-system)
    (use-package font-lock+
      :load-path "site-lisp"
      :demand t))

  (use-package all-the-icons
    :demand t)

  (use-package all-the-icons-dired
    :demand t
    :custom-face (all-the-icons-dired-dir-face ((t (:foreground nil))))
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package all-the-icons-ivy
    :ensure t
    :demand t
    :config
    (setq all-the-icons-ivy-file-commands
          '(counsel-find-file counsel-file-jump counsel-recentf counsel-projectile-find-file counsel-projectile-find-dir))
    (all-the-icons-ivy-setup)
     )
#+end_src
** Ansi-Term
:PROPERTIES:
:CREATED:  [2019-06-01 Sa 14:05]
:END:
I just found =ansi-term= which is a much nicer shell in Emacs. The following code from
https://echosa.github.io/blog/2012/06/06/improving-ansi-term/ removes the buffer after
exiting the shell.
#+begin_src emacs-lisp
(defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
  (if (memq (process-status proc) '(signal exit))
      (let ((buffer (process-buffer proc)))
        ad-do-it
        (kill-buffer buffer))
    ad-do-it))
(ad-activate 'term-sentinel)
#+end_src
** Appointments
I start to use the appointment system as well, so I need to activate it. I don't want to
be reminded more then twice before the appointment itself. I also want the diary entries
sorted.
#+BEGIN_SRC emacs-lisp
(appt-activate 1)
(setq appt-message-warning-time 10
appt-display-interval 5)
(add-hook 'diary-list-entries-hook 'diary-sort-entries t)
#+END_SRC
** Auto-revert
No messages for =auto-revert=
#+begin_src emacs-lisp
  (use-package autorevert
  :ensure nil
  :config
   (setq auto-revert-verbose nil
         global-auto-revert-mode t
         global-auto-revert-non-file-buffers t))
#+end_src
** Auto-save
:LOGBOOK:
- Note taken on [2019-05-12 So 16:43] \\
  Changed lisp code as recommendedon no-litering site
- Note taken on [2018-07-19 Do 18:49] \\
  Added the code for =auto-save-file-name-transforms=
:END:
=no-littering= seems not to include this so I'll add it here
#+BEGIN_SRC emacs-lisp
;(setq auto-save-file-name-transforms
;      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+END_SRC

Emacs 26.1 has builtin auto-save. I'll use that now with auto-saving once a minute rather
than the default 5 seconds.
#+BEGIN_SRC emacs-lisp
(setq auto-save-visited-interval 60)
(auto-save-visited-mode 1)
#+END_SRC
** Centaur Tabs
:PROPERTIES:
:CREATED:  [2019-03-10 So 16:25]
:END:
Let's try tabs again
#+begin_src emacs-lisp
  (use-package centaur-tabs
    :demand t
    :init (setq centaur-tabs-set-bar 'over)
    :config
    (centaur-tabs-headline-match)
    (setq centaur-tabs-set-bar t
          centaur-tabs-height 32
          centaur-tabs-set-icons t
          centaur-tabs-set-modified-marker t
          centaur-tabs-modified-marker " ● "
          centaur-tabs-close-button " × "
          centaur-tabs-style "bar")
    (centaur-tabs-mode t)
    :bind
    ("C-<prior>" . centaur-tabs-backward)
    ("C-<next>" . centaur-tabs-forward)
    :hook
    (dashboard-mode . centaur-tabs-local-mode)
    (term-mode . centaur-tabs-local-mode)
    (calendar-mode . centaur-tabs-local-mode)
    (org-agenda-mode . centaur-tabs-local-mode)
    (helpful-mode . centaur-tabs-local-mode))
  #+end_src
** Calendar
    :LOGBOOK:
    - Note taken on [2018-05-13 So 21:44] \\
      It seems =filter-visible-calendar-holidays= is replaced by =holiday-filter-visible-calendar=
    - Note taken on [2014-10-18 Sa 21:37] \\
      variable names change for holiday: all need to start with 'holiday' now
    :END:
    I prefer German names and local holidays

    #+begin_src emacs-lisp
      (setq calendar-date-style 'european
            calendar-week-start-day 1
            calendar-latitude [48 9 north]
            calendar-longitude [11 34 east]
            calendar-mark-holidays-flag t
            calendar-time-display-form
            '(24-hours ":" minutes
                       (if time-zone " (")
                       time-zone
                       (if time-zone ")"))
            calendar-day-name-array ["Sonntag" "Montag" "Dienstag" "Mittwoch"
                                     "Donnerstag" "Freitag" "Samstag"]
            calendar-month-name-array ["Januar" "Februar" "März" "April" "Mai"
                                       "Juni" "Juli" "August" "September"
                                       "Oktober" "November" "Dezember"]
            solar-n-hemi-seasons
            '("Frühlingsanfang" "Sommeranfang" "Herbstanfang" "Winteranfang")
            holiday-general-holidays
            '((holiday-fixed 1 1 "Neujahr")
              (holiday-fixed 5 1 "1. Mai")
              (holiday-float 5 0 2 "Muttertag")
              (holiday-fixed 10 3 "Tag der Deutschen Einheit"))
            holiday-christian-holidays
            '(
              (holiday-float 12 0 -4 "1. Advent" 24)
              (holiday-float 12 0 -3 "2. Advent" 24)
              (holiday-float 12 0 -2 "3. Advent" 24)
              (holiday-float 12 0 -1 "4. Advent" 24)
              (holiday-fixed 12 25 "1. Weihnachtstag")
              (holiday-fixed 12 26 "2. Weihnachtstag")
              (holiday-fixed 1 6 "Heilige Drei Könige")
              (holiday-easter-etc -48 "Rosenmontag")
              (holiday-easter-etc -2 "Karfreitag")
              (holiday-easter-etc  0 "Ostersonntag")
              (holiday-easter-etc +1 "Ostermontag")
              (holiday-easter-etc +39 "Christi Himmelfahrt")
              (holiday-easter-etc +49 "Pfingstsonntag")
              (holiday-easter-etc +50 "Pfingstmontag")
              (holiday-easter-etc +60 "Fronleichnam")
              (holiday-fixed 8 15 "Mariä Himmelfahrt")
              (holiday-fixed 11 1 "Allerheiligen")
              (holiday-float 11 3 1 "Buß- und Bettag" 16)
              (holiday-float 11 0 1 "Totensonntag" 20)
              (holiday-fixed 12  8 "Mariä Empfängnis"))
            calendar-holidays
            (append holiday-general-holidays holiday-local-holidays holiday-other-holidays
                    holiday-christian-holidays holiday-solar-holidays))
    #+end_src
    Better views of calendar from [[https://github.com/seagle0128/.emacs.d][GitHub - seagle0128/.emacs.d: Centaur Emacs - A Fancy and Fast Emacs Configur...]]
#+begin_src emacs-lisp
  (use-package calfw
    :disabled
    :commands cfw:open-calendar-buffer
    :bind ("<C-f12>" . open-calendar)
    :init
    (use-package calfw-org
      :commands (cfw:open-org-calendar cfw:org-create-source))

    (use-package calfw-cal
      :commands (cfw:open-diary-calendar cfw:cal-create-source))

    (use-package calfw-ical
      :commands (cfw:open-ical-calendar cfw:ical-create-source))

    (defun open-calendar ()
      "Open calendar."
      (interactive)
      (cfw:open-calendar-buffer
                 :contents-sources
                 (list
                  (cfw:org-create-source "Gray") ; org source
                  (cfw:cal-create-source "Orange") ; diary source
                  ))))
#+end_src
** Custom
:PROPERTIES:
:CREATED:  [2018-12-15 Sa 18:32]
:END:
I prefer setting things in this file rather than =custom.el=.
#+BEGIN_SRC emacs-lisp
  (use-package system-packages
    :custom
    (system-packages-noconfirm t))

  (use-package emacs
    :ensure nil
    :custom
    (ad-redefinition-action 'accept)
    (blink-cursor-mode nil)
    (byte-compile-warnings
     (quote
      (redefine callargs free-vars unresolved obsolete noruntime interactive-only)))
    (column-number-mode t)
    (compilation-message-face (quote default))
    (confirm-nonexistent-file-or-buffer nil)
    (debug-on-quit nil)
    (delete-by-moving-to-trash t)
    (delete-selection-mode t)
    (display-line-numbers-type nil)
    (echo-keystrokes 0.5)
    (electric-pair-mode t)
    (fast-but-imprecise-scrolling t)
    (fill-column 90)
    (global-font-lock-mode t nil (font-lock))
    (indent-region-mode t)
    (indent-tabs-mode nil "Spaces!")
    (tab-always-indent 'complete "smart tab behavior - indent or complete")
    (indicate-empty-lines t)
    (inhibit-startup-screen t "Don't show splash screen")
    (initial-buffer-choice t)
    (initial-scratch-message nil)
    (kill-whole-line t)
    (line-spacing 0.2)
    (linum-format " %6d ")
    (mouse-drag-copy-region t)
    (require-final-newline t)
    (save-interprogram-paste-before-kill t)
    (sentence-end-double-space nil)
    (show-paren-mode t)
    (size-indication-mode t)
    (special-display-buffer-names (quote ("*Completions*")))
    (tab-width 2)
    (use-dialog-box nil "Disable dialog boxes")
    (visible-bell t))

  (use-package custom
    :ensure nil
    :custom
    (custom-safe-themes t "Treat all themes as safe"))
#+END_SRC
