my_emacs/emacs.org
** Dashboard
    :LOGBOOK:
    - Note taken on [2018-05-19 Sa 18:22] \\
      Nice idea but not really useful.
    :END:
    A nice dashboard when Emacs is started. Parts of the config taken from https://github.com/michaeltd/.emacs.d
    #+begin_src emacs-lisp
      (use-package dashboard
        :config
        (dashboard-setup-startup-hook)
        (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
              dashboard-center-content t
              dashboard-set-heading-icons t
              dashboard-set-file-icons t
              dashboard-set-init-info t
              dashboard-startup-banner 'official
              dashboard-banner-logo-title (message "Emacs ready in %s with %d garbage collections."
                                                   (format "%.2f seconds"
                                                           (float-time
                                                            (time-subtract after-init-time before-init-time)))
                                                   gcs-done)
              dashboard-footer-icon (all-the-icons-octicon "dashboard"
                                                           :height 1.1
                                                           :v-adjust -0.05
                                                           :face 'font-lock-keyword-face)
              dashboard-items '((recents  . 10)
                                (bookmarks . 5)
                                (agenda . 5))
              show-week-agenda-p t)
        (dashboard-modify-heading-icons '((recents . "file-text")
                                          (bookmarks . "book")))
        :demand t)
    #+end_src
** date2name
    :LOGBOOK:
    - Note taken on [2019-07-07 So 11:59] \\
      It's now in MELPA
- Note taken on [2018-07-20 Fr 08:48] \\
  From Karl Voit's .emacs
:END:
https://github.com/DerBeutlin/date2name.el provides =date2name-dired-add-date-to-name()=
which is an Elisp-native re-implementation of [[https://github.com/novoid/date2name][date2name]]:

#+BEGIN_SRC emacs-lisp
  (use-package date2name
    :demand t)
#+END_SRC
** Dimish
    :LOGBOOK:
    - Note taken on [2018-05-13 So 21:09] \\
    Added from http://www.star.bris.ac.uk/bjm/emacs.html
    :END:
    Diminish minor modes from mode line to save space
    #+begin_src emacs-lisp
      (use-package diminish
      :ensure t
      :demand t
      :diminish abbrev-mode
      :diminish auto-fill-function
      :diminish eldoc-mode
      :diminish counsel-mode
      :diminish visual-line-mode
      :diminish undo-tree-mode
      :diminish company-mode)
    #+end_src
** Dired
:LOGBOOK:
- Note taken on [2018-10-28 So 12:13] \\
  There is a new way to hide details in =dired=. Seems to be enough instead of dired-details
  so I removed it. Also added some other goodies.
:END:
Config =dired= with =use-package=
#+BEGIN_SRC emacs-lisp
  (use-package dired
    :ensure nil
    :custom (dired-dwim-target t "guess a target directory")
    :hook
    (dired-mode . dired-hide-details-mode))
#+END_SRC

This provides a sidebar with a dired buffer for the current directory
#+BEGIN_SRC emacs-lisp
  (use-package dired-toggle
    :defer t)
#+END_SRC

Usually I'm not interested in dotfiles
#+BEGIN_SRC emacs-lisp
  (use-package dired-hide-dotfiles
    :bind
    (:map dired-mode-map
          ("." . dired-hide-dotfiles-mode))
    :hook
    (dired-mode . dired-hide-dotfiles-mode))
#+END_SRC

And I like more colors
#+BEGIN_SRC emacs-lisp
  (use-package diredfl
    :hook
    (dired-mode . diredfl-mode))
#+END_SRC

From http://pragmaticemacs.com/emacs/tree-style-directory-views-in-dired-with-dired-subtree/

The dired-subtree package (part of the magnificent dired hacks) improves on this by
allowing you to expand subdirectories in place, like a tree structure. To install the
package, use the following code:
#+BEGIN_SRC emacs-lisp
  (use-package dired-subtree
    :config
    (bind-keys :map dired-mode-map
               ("i" . dired-subtree-insert)
               (";" . dired-subtree-remove)))
#+END_SRC

This sets up the keybinds so that in dired, hitting i on a subdirectory expands it in
place with an indented listing. You can expand sub-subdirectories in the same way, and so
on. Hitting ; inside an expanded subdirectory collapses it.

A nice overview for git repositories in dired
#+begin_src emacs-lisp
(use-package dired-git-info
    :ensure t
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode)))
#+end_src

From [[http://pragmaticemacs.com/emacs/dynamically-filter-directory-listing-with-dired-narrow/][Dynamically filter directory listing with dired-narrow | Pragmatic Emacs]] a useful
addition to narrow dired to match filter

#+begin_src emacs-lisp
(use-package dired-narrow
  :ensure t
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))
#+end_src
** Display
:PROPERTIES:
:CREATED:  [2018-12-15 Sa 18:06]
:END:
Display related settings
#+BEGIN_SRC emacs-lisp
  (setq global-display-line-numbers-mode t
        global-hl-line-sticky-flag t
        global-visual-line-mode t)
#+END_SRC
** Delete duplicate entries of the history of the minibuffer
:LOGBOOK:
- Note taken on [2018-07-19 Do 18:37] \\
  From Karl Voit's .emacs
:END:
«If the value of this variable is t, that means when adding a new
history element, all previous identical elements are deleted.» from:
http://www.gnu.org/software/emacs/manual/html_node/elisp/Minibuffer-History.html

#+BEGIN_SRC emacs-lisp
(setq history-delete-duplicates t)
#+END_SRC
** Disk usage
:PROPERTIES:
:CREATED:  [2019-02-24 So 10:52]
:END:
A nice package to show the disk usage
#+begin_src emacs-lisp
(use-package disk-usage
  :ensure t)
#+end_src
** Emacs Server
Useful to reuse the already running instance
#+BEGIN_SRC emacs-lisp
(unless (and (fboundp 'server-running-p)
             (server-running-p))
  (server-start))
#+END_SRC
** filetags.el
:LOGBOOK:
- Note taken on [2019-07-07 So 12:00] \\
  It's now on MELPA
- Note taken on [2018-07-20 Fr 08:47] \\
  From Karl Voit's .emacs
:END:

https://github.com/DerBeutlin/filetags.el provides =filetags-dired-update-tags()= which is
an Elisp-native re-implementation of [[https://github.com/novoid/filetags/][filetags]]:

It requires =ivy= to work so I used =package-install= to install it from Melpa. Afterwards
it seems to work. At least on ArchLabs it also requires the =s= package so I'll add that.
#+BEGIN_SRC emacs-lisp
;  (use-package s
;    :demand t)
;  (require 's)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package filetags
      :demand t
      :custom
      (filetags-load-controlled-vocabulary-from-file t "read CV from .filetags files within same or upper directories")
  )
#+END_SRC
** Golden ratio scrolling
    Improved scrolling in larger files
    #+BEGIN_SRC emacs-lisp
      (use-package golden-ratio-scroll-screen
        :ensure t
        :bind(([remap scroll-down-command] . golden-ratio-scroll-screen-down)
              ([remap scroll-up-command] . golden-ratio-scroll-screen-up)))
    #+END_SRC
** Helpful
:PROPERTIES:
:CREATED:  [2018-12-17 Mo 10:21]
:END:
Helpful is a useful replacement for the standard help buffer see [[https://github.com/Wilfred/helpful][GitHub - Wilfred/helpful: A better Emacs *help* buffer]]
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :bind (
           ("C-h f" . helpful-callable)
           ("C-h v" . helpful-variable)
           ("C-h k" . helpful-key)))
#+END_SRC
** Highlight the current line
    :LOGBOOK:
    - Note taken on [2013-07-13 Sa 20:13] \\
      It needs to be =global-hl-line-mode= otherwise it won't work globally
    :END:
    Set a custom face, so we can recognize it from the normal (selection) marking
    #+begin_src emacs-lisp
      (global-hl-line-mode 1)
      (setq hl-line-face 'hl-line)
    #+end_src
** Ido-mode
    :LOGBOOK:
    - Note taken on [2018-10-01 Mo 21:20] \\
      Disabled I use ivy instead
    - Note taken on [2018-05-18 Fr 21:47] \\
      Added ido-enable-flex-matching t
    - Note taken on [2018-05-08 Tue 20:47] \\
      Prefer use-package to defer loading
    :END:
    Ido mode is very cool for buffer management. This uses =use-package= rather than
    =custom.el=.
    #+begin_src emacs-lisp
      (use-package ido
        :config
        :disabled t
        (setq ido-create-new-buffer (quote always)
              ido-enable-flex-matching t)
        (ido-mode (quote buffers))
        :ensure nil)
    #+end_src
** Ivy
:PROPERTIES:
:CREATED:  [2018-07-24 Di 21:32]
:END:
Yet another completion tool. From
https://www.reddit.com/r/emacs/comments/910pga/tip_how_to_use_ivy_and_its_utilities_in_your/
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :pin MELPA
    :diminish
    :bind (("C-c C-r" . ivy-resume)
           ("C-x B" . ivy-switch-buffer-other-window))
    :config
    (setq ivy-count-format "(%d/%d) "
          ivy-display-style 'fancy
          ivy-use-virtual-buffers t
          ivy-virtual-abbreviate 'full)
    (ivy-mode))

  (use-package counsel
    :after ivy
    :ensure t
    :config (counsel-mode)
    :bind ("\C-x\C-r" . counsel-recentf))

  (use-package ivy-rich
    :after ivy
    :config
    (setq ivy-rich-path-style 'abbrev)
    (ivy-rich-mode 1))

  (use-package swiper
    :after ivy
    :ensure t
    :bind (("C-s" . swiper)
           ("C-r" . swiper)))
#+END_SRC
** Keyboard settings
    :LOGBOOK:
    - Note taken on [2018-09-17 Mo 10:33] \\
      C-c C-r is now bound within org so the somment-region keybinding doesn't work anymore
    - Note taken on [2016-12-11 So 11:56] \\
      I don't use =org-trello= anymore so back to =occur= binding.
    - Note taken on [2013-08-18 So 18:30] \\
      the key binding for =occur= is removed because it's also used by =org-trello=
    :END:
    This is a list of special key settings for different functions I use a lot:
    - have RET indent according to mode
      #+begin_src emacs-lisp
      (global-set-key (kbd "RET") 'newline-and-indent)
      #+end_src
    - make it easy to call =occur=
      #+begin_src emacs-lisp
      (global-set-key "\C-co" 'occur)
      #+end_src
    - I found =ibuffer= on
      http://ergoemacs.org/emacs/emacs_buffer_management.html.
      This seems better than =buffer-menu=
      #+begin_src emacs-lisp
        (defalias 'list-buffers 'ibuffer)
      #+end_src
    - I never use =set-fill-column= but want to find a file
      #+begin_src emacs-lisp
        (define-key ctl-x-map "f" 'find-file)
      #+end_src
    - make it easy to comment a region (C-u C-c C-r uncomments the region)
      #+begin_src emacs-lisp
      ;  (global-set-key "\C-c\C-r" 'comment-region)
      #+end_src
    - make it easy to go to a line
      #+begin_src emacs-lisp
        (global-set-key "\M-g" 'goto-line)
      #+end_src
    - easily revert a buffer
      #+begin_src emacs-lisp
      (global-set-key "\C-c\C-v" '(lambda () (interactive) (revert-buffer nil t)))
      #+end_src
    - Use "y or n" answers instead of full words "yes or no"
      #+begin_src emacs-lisp
      (fset 'yes-or-no-p 'y-or-n-p)
      #+end_src
** Menu bar
:PROPERTIES:
:CREATED:  [2018-10-28 So 11:47]
:END:
:LOGBOOK:
- Note taken on [2018-10-28 So 11:49] \\
  Cool idea from [[https://github.com/a13/emacs.d][GitHub - a13/emacs.d]]
:END:
Most of the time I don't  need the menu bar but it's useful to quickly get to it
#+BEGIN_SRC emacs-lisp
  (use-package menu-bar
    :ensure nil
    :config
    (menu-bar-mode 1)
    :bind
    ([S-f10] . menu-bar-mode))
#+END_SRC
