my_emacs/emacs.el

(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
        dashboard-center-content t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-set-init-info t
        dashboard-startup-banner 'official
        dashboard-banner-logo-title (message "Emacs ready in %s with %d garbage collections."
                                             (format "%.2f seconds"
                                                     (float-time
                                                      (time-subtract after-init-time before-init-time)))
                                             gcs-done)
        dashboard-footer-icon (all-the-icons-octicon "dashboard"
                                                     :height 1.1
                                                     :v-adjust -0.05
                                                     :face 'font-lock-keyword-face)
        dashboard-items '((recents  . 10)
                          (bookmarks . 5)
                          (agenda . 5))
        show-week-agenda-p t)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book")))
  :demand t)

(use-package date2name
  :demand t)

(use-package diminish
:ensure t
:demand t
:diminish abbrev-mode
:diminish auto-fill-function
:diminish eldoc-mode
:diminish counsel-mode
:diminish visual-line-mode
:diminish undo-tree-mode
:diminish company-mode)

(use-package dired
  :ensure nil
  :custom (dired-dwim-target t "guess a target directory")
  :hook
  (dired-mode . dired-hide-details-mode))

(use-package dired-toggle
  :defer t)

(use-package dired-hide-dotfiles
  :bind
  (:map dired-mode-map
        ("." . dired-hide-dotfiles-mode))
  :hook
  (dired-mode . dired-hide-dotfiles-mode))

(use-package diredfl
  :hook
  (dired-mode . diredfl-mode))

(use-package dired-subtree
  :config
  (bind-keys :map dired-mode-map
             ("i" . dired-subtree-insert)
             (";" . dired-subtree-remove)))

(use-package dired-git-info
    :ensure t
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode)))

(use-package dired-narrow
  :ensure t
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))

(setq global-display-line-numbers-mode t
      global-hl-line-sticky-flag t
      global-visual-line-mode t)

(setq history-delete-duplicates t)

(use-package disk-usage
  :ensure t)

(unless (and (fboundp 'server-running-p)
             (server-running-p))
  (server-start))

;  (use-package s
;    :demand t)
;  (require 's)

(use-package filetags
    :demand t
    :custom
    (filetags-load-controlled-vocabulary-from-file t "read CV from .filetags files within same or upper directories")
)

(use-package golden-ratio-scroll-screen
  :ensure t
  :bind(([remap scroll-down-command] . golden-ratio-scroll-screen-down)
        ([remap scroll-up-command] . golden-ratio-scroll-screen-up)))

(use-package helpful
  :bind (
         ("C-h f" . helpful-callable)
         ("C-h v" . helpful-variable)
         ("C-h k" . helpful-key)))

(global-hl-line-mode 1)
(setq hl-line-face 'hl-line)

(use-package ido
  :config
  :disabled t
  (setq ido-create-new-buffer (quote always)
        ido-enable-flex-matching t)
  (ido-mode (quote buffers))
  :ensure nil)

(use-package ivy
  :pin MELPA
  :diminish
  :bind (("C-c C-r" . ivy-resume)
         ("C-x B" . ivy-switch-buffer-other-window))
  :config
  (setq ivy-count-format "(%d/%d) "
        ivy-display-style 'fancy
        ivy-use-virtual-buffers t
        ivy-virtual-abbreviate 'full)
  (ivy-mode))

(use-package counsel
  :after ivy
  :ensure t
  :config (counsel-mode)
  :bind ("\C-x\C-r" . counsel-recentf))

(use-package ivy-rich
  :after ivy
  :config
  (setq ivy-rich-path-style 'abbrev)
  (ivy-rich-mode 1))

(use-package swiper
  :after ivy
  :ensure t
  :bind (("C-s" . swiper)
         ("C-r" . swiper)))

(global-set-key (kbd "RET") 'newline-and-indent)

(global-set-key "\C-co" 'occur)

(defalias 'list-buffers 'ibuffer)

(define-key ctl-x-map "f" 'find-file)

;  (global-set-key "\C-c\C-r" 'comment-region)

(global-set-key "\M-g" 'goto-line)

(global-set-key "\C-c\C-v" '(lambda () (interactive) (revert-buffer nil t)))

(fset 'yes-or-no-p 'y-or-n-p)

(use-package menu-bar
  :ensure nil
  :config
  (menu-bar-mode 1)
  :bind
  ([S-f10] . menu-bar-mode))

(when (window-system)
