my_emacs/emacs.org
** Minimal
Replace the mode-line by a single small line. Useful for distraction-free writing
 #+BEGIN_SRC emacs-lisp
   (when (window-system)
     (use-package minimal
       :load-path "lisp/minimal"
       :demand t))
 #+END_SRC
** Minions
:PROPERTIES:
:CREATED:  [2019-02-10 So 17:35]
:END:
Another package to reduce clutter in the mode-line from [[https://github.com/tarsius/minions][GitHub - tarsius/minions: A minor-mode menu for the mode line]]
 #+begin_src emacs-lisp
   (use-package minions
     :demand t
     :init (minions-mode)
     :config
     (setq minions-mode-line-lighter "#"))
 #+end_src
** Mixed-pitch
:PROPERTIES:
:CREATED:  [2020-02-01 Sa 21:38]
:END:
This mode makes it easier to have both variable-pitch and fixed-pitch in a buffer
#+begin_src emacs-lisp
(use-package mixed-pitch
  :hook
  ;; If you want it in all text modes:
  (text-mode . mixed-pitch-mode))
#+end_src
** mode-icons - Show icons instead of mode names

https://github.com/ryuslash/mode-icons

via: https://www.reddit.com/r/emacs/comments/5fjri7/how_to_use_git_logo_in_modeline_instead_of/

This enhances the style of Emacs IMHO.

#+BEGIN_SRC emacs-lisp
(use-package mode-icons
  :demand t
  :config
  (mode-icons-mode)
)
#+END_SRC
** Modernized Package Menu
:PROPERTIES:
:CREATED:  [2018-10-28 So 11:38]
:END:
Improves the package menu via [[https://github.com/a13/emacs.d][GitHub - a13/emacs.d]]

#+BEGIN_SRC emacs-lisp
  (use-package paradox
    :defer 1
    :config
    (setq  paradox-automatically-star nil)
    (paradox-enable))
#+END_SRC
** Moody
:PROPERTIES:
:CREATED:  [2019-02-10 So 17:48]
:END:
Some eye candy for the modelina from [[https://github.com/tarsius/moody][GitHub - tarsius/moody: Tabs and ribbons for the mode-line]]
#+begin_src emacs-lisp
  (when (display-graphic-p)
    (use-package moody
      :demand t
      :config
      (setq x-underline-at-descent-line t)
      (moody-replace-mode-line-buffer-identification)
      (moody-replace-vc-mode)))
#+end_src
** msb-Mode
    :LOGBOOK:
    - Note taken on [2018-05-07 Mon 21:59] \\
      Added use-package rather than custom.el
    :END:
    From https://www.gnu.org/software/emacs/manual/html_node/emacs/Buffer-Menus.html: MSB
    global minor mode (“MSB” stands for “mouse select buffer”) provides a different and
    customizable mouse buffer menu which you may prefer. It replaces the mouse-buffer-menu
    commands, normally bound to C-Down-mouse-1 and C-<F10>, with its own commands, and
    also modifies the menu-bar buffer menu.

    #+begin_src emacs-lisp
    (use-package msb
    :config
    (msb-mode 1)
    :ensure nil)
    #+end_src
** No blinking cursor
    I find a blinking cursor distracting.
    #+begin_src emacs-lisp
    (blink-cursor-mode 0)
    #+end_src
** Open-with
:PROPERTIES:
:CREATED:  [2019-08-16 Fr 18:13]
:END:
On Linux I prefer to open PDF externally not within =doc-view=. The easiest way seems to be using =open-with=.
#+begin_src emacs-lisp

  (cond ((eq system-type 'gnu/linux)
         (use-package openwith
           :config
           (openwith-mode t)
           (setq openwith-associations '(("\\.pdf\\'" "evince" (file)))))))
#+end_src
** Recentf
    :LOGBOOK:
    - Note taken on [2018-08-09 Do 22:58] \\
      Exclude the no-littering directories
    - Note taken on [2018-05-07 Mon 21:38] \\
      Added to reduce startup time
    :END:
An idea from https://blog.d46.us/advanced-emacs-startup/ to reduce emacs startup time
#+begin_src emacs-lisp
  (use-package recentf
  :config
  (setq recentf-max-saved-items 40
        recentf-max-menu-items 15
        recentf-menu-open-all-flag t
        ;; disable recentf-cleanup on Emacs start, because it can cause
        ;; problems with remote files
        recentf-cleanup-auto 'never)
  (add-to-list 'recentf-exclude  (expand-file-name package-user-dir))
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  :hook (after-init . recentf-mode))
#+end_src
** Saveplace
    :LOGBOOK:
    - Note taken on [2018-05-08 Tue 20:59] \\
      Switch to =use-package=
    :END:
    #+begin_src emacs-lisp
      (use-package saveplace
        :config
        (save-place-mode t)
        :ensure nil)
    #+end_src
** Smooth scrolling
    :LOGBOOK:
    - Note taken on [2013-11-02 Sa 22:07] \\
      Newly added
    :END:
    Emacs's default scrolling behavior, like a lot of the default Emacs experience, is
    pretty idiosyncratic. The following snippet makes for a smoother scrolling behavior
    when using keyboard navigation.

    #+begin_src emacs-lisp
     (setq redisplay-dont-pause t
           scroll-margin 1
           scroll-step 1
           scroll-conservatively 10000
           scroll-preserve-screen-position 1)
   #+end_src
** Split Windows
:PROPERTIES:
:CREATED:  [2021-03-04 Do 21:50]
:END:
An improved version to split windows hierarchcially and vertically from [[https://github.com/sje30/emacs][GitHub - sje30/emacs: my notes about emacs]]
#+begin_src emacs-lisp
(defun my/split-below-last-buffer (prefix)
"Split the window above/below and display the previous buffer.
If prefix arg is provided, show current buffer twice."
(interactive "p")
(split-window-below)
(other-window 1 nil)
(if (= prefix 1)
(switch-to-next-buffer)))

(defun my/split-right-last-buffer (prefix)
"Split the window left/right and display the previous buffer
If prefix arg is provided, show current buffer twice."
(interactive "p")
(split-window-right)
(other-window 1 nil)
(if (= prefix 1) (switch-to-next-buffer)))

(global-set-key (kbd "C-x 2")  'my/split-below-last-buffer)
(global-set-key (kbd "C-x 3")  'my/split-right-last-buffer)
(setq switch-to-prev-buffer-skip 'this)
#+end_src
** Time
:PROPERTIES:
:CREATED:  [2018-12-15 Sa 18:31]
:END:
Settings for the time in the mode line
#+BEGIN_SRC emacs-lisp
  (use-package time
    :defer t
    :ensure nil
    :custom
    (display-time-default-load-average nil)
    (display-time-24hr-format t)
    (display-time-day-and-date t)
    (display-time-interval 30)
    (display-time-string-forms
     (quote
      ((if display-time-day-and-date
           (format "%s %s. %s " dayname day monthname)
         "")
       (format "%s:%s%s"
               (if display-time-24hr-format 24-hours 12-hours)
               minutes
               (if display-time-24hr-format "" am-pm)))))
    :config
    (display-time-mode t))
#+END_SRC
** Treemacs
:PROPERTIES:
:CREATED:  [2019-07-21 So 21:33]
:END:
Treemacs makes for a nice sidebar similar to other editors
#+begin_src emacs-lisp
(use-package treemacs
  :ensure t
  :defer t
  :init
  :config
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))
#+end_src
I like icons in the dired buffer from =treemacs=
#+BEGIN_SRC emacs-lisp
(use-package treemacs-icons-dired
  :after treemacs dired
  :ensure t
  :config (treemacs-icons-dired-mode))
#+END_SRC
** Undo Tree
:PROPERTIES:
:CREATED:  [2020-01-03 Fr 20:58]
:END:
Allow tree-semantics for undo operations.
#+begin_src emacs-lisp
  (use-package undo-tree
    :config
    ;; Always have it on
    (global-undo-tree-mode)

    ;; Each node in the undo tree should have a timestamp.
    (setq undo-tree-visualizer-timestamps t)

    ;; Show a diff window displaying changes between undo nodes.
    (setq undo-tree-visualizer-diff t))
#+end_src
** Uniquify
    Emacs's standard method for making buffer names unique adds <2>, <3>, etc. to the end
    of (all but one of) the buffers. =uniquify= replaces that behavior, for buffers
    visiting files and dired buffers, with a uniquification that adds parts of the file
    name until the buffer names are unique.
    #+begin_src emacs-lisp
      (use-package uniquify
        :config
        (setq uniquify-buffer-name-style 'forward)
        :ensure nil)
    #+end_src
** Visualise whitespace
    :LOGBOOK:
    - Note taken on [2018-05-13 So 21:09] \\
    Added from http://www.star.bris.ac.uk/bjm/emacs.html
    :END:
    This can be useful to find trailing whitespaces. I won't need it often.
    #+begin_src emacs-lisp
    (use-package whitespace
    :diminish whitespace-mode)
    #+end_src
** Which-key
:PROPERTIES:
:CREATED:  [2018-12-09 So 22:41]
:END:
=which-key= provides visual hints for keybindings
#+BEGIN_SRC emacs-lisp
(use-package which-key
:hook (after-init . which-key-mode))
#+END_SRC
* Editing related items
** Abbrevs
    I use abbrevs mainly to correct common spelling errors
    #+begin_src emacs-lisp
    (setq-default abbrev-mode t)     ;; enable abbreviations
    (setq save-abbrevs 'silently)    ;; save abbreviations upon exiting emacs
    (if (file-exists-p abbrev-file-name)
    (quietly-read-abbrev-file))  ;; reads the abbreviations file on startup
    #+end_src
** Comment lines
    :LOGBOOK:
    - Note taken on [2018-05-26 Sa 19:17] \\
      From http://www.star.bris.ac.uk/bjm/emacs.html
    :END:
    Comment lines easily
    #+BEGIN_SRC emacs-lisp
    (use-package comment-dwim-2
    :bind (("M-;" . comment-dwim-2)))
    #+END_SRC
