my_emacs/emacs.el
  (use-package minimal
    :load-path "lisp/minimal"
    :demand t))

(use-package minions
  :demand t
  :init (minions-mode)
  :config
  (setq minions-mode-line-lighter "#"))

(use-package mixed-pitch
  :hook
  ;; If you want it in all text modes:
  (text-mode . mixed-pitch-mode))

(use-package mode-icons
  :demand t
  :config
  (mode-icons-mode)
)

(use-package paradox
  :defer 1
  :config
  (setq  paradox-automatically-star nil)
  (paradox-enable))

(when (display-graphic-p)
  (use-package moody
    :demand t
    :config
    (setq x-underline-at-descent-line t)
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode)))

(use-package msb
:config
(msb-mode 1)
:ensure nil)

(blink-cursor-mode 0)

(cond ((eq system-type 'gnu/linux)
       (use-package openwith
         :config
         (openwith-mode t)
         (setq openwith-associations '(("\\.pdf\\'" "evince" (file)))))))

(use-package recentf
:config
(setq recentf-max-saved-items 40
      recentf-max-menu-items 15
      recentf-menu-open-all-flag t
      ;; disable recentf-cleanup on Emacs start, because it can cause
      ;; problems with remote files
      recentf-cleanup-auto 'never)
(add-to-list 'recentf-exclude  (expand-file-name package-user-dir))
(add-to-list 'recentf-exclude no-littering-var-directory)
(add-to-list 'recentf-exclude no-littering-etc-directory)
:hook (after-init . recentf-mode))

(use-package saveplace
  :config
  (save-place-mode t)
  :ensure nil)

(setq redisplay-dont-pause t
      scroll-margin 1
      scroll-step 1
      scroll-conservatively 10000
      scroll-preserve-screen-position 1)

(defun my/split-below-last-buffer (prefix)
"Split the window above/below and display the previous buffer.
If prefix arg is provided, show current buffer twice."
(interactive "p")
(split-window-below)
(other-window 1 nil)
(if (= prefix 1)
(switch-to-next-buffer)))

(defun my/split-right-last-buffer (prefix)
"Split the window left/right and display the previous buffer
If prefix arg is provided, show current buffer twice."
(interactive "p")
(split-window-right)
(other-window 1 nil)
(if (= prefix 1) (switch-to-next-buffer)))

(global-set-key (kbd "C-x 2")  'my/split-below-last-buffer)
(global-set-key (kbd "C-x 3")  'my/split-right-last-buffer)
(setq switch-to-prev-buffer-skip 'this)

(use-package time
  :defer t
  :ensure nil
  :custom
  (display-time-default-load-average nil)
  (display-time-24hr-format t)
  (display-time-day-and-date t)
  (display-time-interval 30)
  (display-time-string-forms
   (quote
    ((if display-time-day-and-date
         (format "%s %s. %s " dayname day monthname)
       "")
     (format "%s:%s%s"
             (if display-time-24hr-format 24-hours 12-hours)
             minutes
             (if display-time-24hr-format "" am-pm)))))
  :config
  (display-time-mode t))

(use-package treemacs
  :ensure t
  :defer t
  :init
  :config
    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-icons-dired
  :after treemacs dired
  :ensure t
  :config (treemacs-icons-dired-mode))

(use-package undo-tree
  :config
  ;; Always have it on
  (global-undo-tree-mode)

  ;; Each node in the undo tree should have a timestamp.
  (setq undo-tree-visualizer-timestamps t)

  ;; Show a diff window displaying changes between undo nodes.
  (setq undo-tree-visualizer-diff t))

(use-package uniquify
  :config
  (setq uniquify-buffer-name-style 'forward)
  :ensure nil)

(use-package whitespace
:diminish whitespace-mode)

(use-package which-key
:hook (after-init . which-key-mode))

(setq-default abbrev-mode t)     ;; enable abbreviations
(setq save-abbrevs 'silently)    ;; save abbreviations upon exiting emacs
(if (file-exists-p abbrev-file-name)
(quietly-read-abbrev-file))  ;; reads the abbreviations file on startup

(use-package comment-dwim-2
:bind (("M-;" . comment-dwim-2)))
