my_emacs/emacs.org
** Company
    :LOGBOOK:
    - Note taken on [2015-12-18 Fr 09:18] \\
      Added as a try
    :END:
    Let's try auto-complete in emacs.
    Accorcing to the docs this should provide company globally and load company mode html
    backend
    #+begin_src emacs-lisp
    (use-package company-web
    :diminish t
    :hook (after-init . global-company-mode))
    #+end_src

    Some more config coming from
    https://www.reddit.com/r/emacs/comments/8z4jcs/tip_how_to_integrate_company_as_completion/
    #+BEGIN_SRC emacs-lisp
      (use-package company
        :diminish
        :config
        (setq company-begin-commands '(self-insert-command)
              company-minimum-prefix-length 2
              company-show-numbers t
              company-tooltip-align-annotations 't)
        :hook (after-init . global-company-mode))
    #+END_SRC
    including nice GUI
    #+BEGIN_SRC emacs-lisp
      (when ( window-system)
        (use-package company-box
          :after company
          :diminish
          :hook (company-mode . company-box-mode)
          :init (setq company-box-icons-alist 'company-box-icons-all-the-icons)
        :config
        (setq company-box-backends-colors nil)
        (setq company-box-show-single-candidate t)
        (setq company-box-max-candidates 50)
        (with-eval-after-load 'all-the-icons
          (declare-function all-the-icons-faicon 'all-the-icons)
          (declare-function all-the-icons-material 'all-the-icons)
          (setq company-box-icons-all-the-icons
                `((Unknown . ,(all-the-icons-material "find_in_page" :height 0.9 :v-adjust -0.2))
                  (Text . ,(all-the-icons-faicon "text-width" :height 0.85 :v-adjust -0.05))
                  (Method . ,(all-the-icons-faicon "cube" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-purple))
                  (Function . ,(all-the-icons-faicon "cube" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-purple))
                  (Constructor . ,(all-the-icons-faicon "cube" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-purple))
                  (Field . ,(all-the-icons-faicon "tag" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-lblue))
                  (Variable . ,(all-the-icons-faicon "tag" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-lblue))
                  (Class . ,(all-the-icons-material "settings_input_component" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-orange))
                  (Interface . ,(all-the-icons-material "share" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-lblue))
                  (Module . ,(all-the-icons-material "view_module" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-lblue))
                  (Property . ,(all-the-icons-faicon "wrench" :height 0.85 :v-adjust -0.05))
                  (Unit . ,(all-the-icons-material "settings_system_daydream" :height 0.9 :v-adjust -0.2))
                  (Value . ,(all-the-icons-material "format_align_right" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-lblue))
                  (Enum . ,(all-the-icons-material "storage" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-orange))
                  (Keyword . ,(all-the-icons-material "filter_center_focus" :height 0.9 :v-adjust -0.2))
                  (Snippet . ,(all-the-icons-material "format_align_center" :height 0.9 :v-adjust -0.2))
                  (Color . ,(all-the-icons-material "palette" :height 0.9 :v-adjust -0.2))
                  (File . ,(all-the-icons-faicon "file-o" :height 0.9 :v-adjust -0.05))
                  (Reference . ,(all-the-icons-material "collections_bookmark" :height 0.9 :v-adjust -0.2))
                  (Folder . ,(all-the-icons-faicon "folder-open" :height 0.9 :v-adjust -0.05))
                  (EnumMember . ,(all-the-icons-material "format_align_right" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-lblue))
                  (Constant . ,(all-the-icons-faicon "square-o" :height 0.9 :v-adjust -0.05))
                  (Struct . ,(all-the-icons-material "settings_input_component" :height 0.9 :v-adjust -0.2 :face 'all-the-icons-orange))
                  (Event . ,(all-the-icons-faicon "bolt" :height 0.85 :v-adjust -0.05 :face 'all-the-icons-orange))
                  (Operator . ,(all-the-icons-material "control_point" :height 0.9 :v-adjust -0.2))
                  (TypeParameter . ,(all-the-icons-faicon "arrows" :height 0.85 :v-adjust -0.05))
                  (Template . ,(all-the-icons-material "format_align_center" :height 0.9 :v-adjust -0.2))))))
       )
    #+END_SRC
    Some additional settings mentioned on https://github.com/osv/company-web
    #+begin_src emacs-lisp
    (setq company-tooltip-limit 20)                      ; bigger popup window
    (setq company-tooltip-align-annotations 't)          ; align annotations to the right tooltip border
    (setq company-idle-delay .3)                         ; decrease delay before autocompletion popup shows
    (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
    #+end_src
** Deft
    :LOGBOOK:
    - Note taken on [2018-04-29 So 21:08] \\
      Changed deft-use-filename-as-title to nil which seems to use the filter string
      Removed the global-key because C-c d to insert date is more convenient
    - Note taken on [2018-02-26 Mon 22:35] \\
      Added for a test
    :END:
    Deft is an Emacs mode for quickly browsing, filtering, and editing directories of
    plain text notes, inspired by Notational Velocity.

    I want readable filenames =deft-use-filename-as-title= is =nil= but
    =deft-use-filter-string-for-filename= is non-nil: In this case the title shown is
    parsed from the first line of the file while also generating readable filenames for
    new files based on the filter string. That also gets added as a title into the file.
    #+begin_src emacs-lisp
      (use-package deft
      :init
      (setq deft-directory (concat cloud-dir "org"))
      :config
      (setq deft-default-extension "org"
      deft-use-filename-as-title nil
      deft-use-filter-string-for-filename t
      deft-auto-save-interval 0
      deft-org-mode-title-prefix t
      deft-file-naming-rules
        '((noslash . "-")
          (nospace . "-")
          (case-fn . capitalize)))
      :bind ("C-x C-d" . deft-find-file))
    #+end_src

Some ideas from [[http://pragmaticemacs.com/category/deft/][deft | Pragmatic Emacs]]
- make deft behave similar to =org-capture=.
  advise deft to save window config
  #+begin_src emacs-lisp
    (defun bjm-deft-save-windows (orig-fun &rest args)
      (setq bjm-pre-deft-window-config (current-window-configuration))
      (apply orig-fun args)
      )

    (advice-add 'deft :around #'bjm-deft-save-windows)
  #+end_src
  function to quit a deft edit cleanly back to pre deft window
 #+begin_src emacs-lisp
   (defun bjm-quit-deft ()
     "Save buffer, kill buffer, kill deft buffer, and restore window config to the way it was before deft was invoked"
     (interactive)
     (save-buffer)
     (kill-this-buffer)
     (switch-to-buffer "*Deft*")
     (kill-this-buffer)
     (when (window-configuration-p bjm-pre-deft-window-config)
       (set-window-configuration bjm-pre-deft-window-config)
       )
     )

   (global-set-key (kbd "C-c q") 'bjm-quit-deft)
  #+end_src
** delete-trailing-whitespace before saving
:LOGBOOK:
- Note taken on [2018-07-19 Do 18:39] \\
  From Karl Voit's .emacs
:END:
#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC
** Ediff
:PROPERTIES:
:CREATED:  [2020-05-01 Fr 21:23]
:END:
Some settings that make it more convenient to use =ediff=: split windows horicontally not vertically
#+begin_src emacs-lisp
  (setq ediff-diff-options "--binary -w"
        ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src
** Grip mode
#+begin_src emacs-lisp
(use-package grip-mode
  :ensure t)
#+end_src
** Hippie-expand
    :LOGBOOK:
    - Note taken on [2018-05-13 So 21:18] \\
      Added from http://www.star.bris.ac.uk/bjm/emacs.html
    :END:
    This is a useful extension to text expansion
    #+begin_src emacs-lisp
      (global-set-key (kbd "M-/") 'hippie-expand)
      (setq hippie-expand-try-functions-list
            '(try-expand-dabbrev
              try-expand-dabbrev-all-buffers
              try-expand-dabbrev-from-kill
              try-complete-file-name-partially
              try-complete-file-name
              try-expand-all-abbrevs
              try-expand-list
              try-expand-line
              try-complete-lisp-symbol-partially
              try-complete-lisp-symbol)
            hippie-expand-dabbrev-as-symbol t
            hippie-expand-dabbrev-skip-space nil)
    #+end_src
** JSON-Navigator
:PROPERTIES:
:CREATED:  [2019-12-09 Mo 21:21]
:END:
This is a nice visual representation for JSON Files
#+begin_src emacs-lisp
(use-package json-navigator)
#+end_src
** Markdown mode
:PROPERTIES:
:CREATED:  [2018-07-31 Di 22:38]
:END:
There are a bunch of markdown files I use regularly. So a fitting mode is appropriate.
#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "pandoc --from markdown -t html5 --standalone"))
#+END_SRC
** Nov
:PROPERTIES:
:CREATED:  [2019-01-01 Di 18:27]
:END:
=nov= is a mode to read epub files in Emacs. It looks nice so I'll try that.
 #+begin_src emacs-lisp
   (use-package nov
     :mode ("\\.epub\\'" . nov-mode)
     :config
     (setq nov-text-width 100))
 #+end_src
