my_emacs/emacs.org
** Olivetti mode
:PROPERTIES:
:CREATED:  [2018-10-01 Mo 20:45]
:END:
Olivetti provides a nice distraction-free environment.
#+BEGIN_SRC emacs-lisp
  (use-package olivetti
    :custom
    (olivetti-body-width 0.8)
    (olivetti-hide-mode-line t)
    )

#+END_SRC
** Orgmode
    :LOGBOOK:
    - Note taken on [2018-07-10 Di 07:54] \\
      Added org-expiry to get a CREATED property for new headings
    - Note taken on [2018-05-03 Do 06:59] \\
      Going back to org-mode for tasks
    - Note taken on [2015-04-12 So 16:18] \\
      Mobile-org removed again
    - Note taken on [2014-11-13 Do 07:57] \\
      Another try for MobileOrg
    - Note taken on [2013-08-18 So 18:32] \\
      Notes can be added in the LOGBOOK drawer with C-c C-z
    :END:
      Finally ;-)-
*** General settings
:LOGBOOK:
- Note taken on [2018-12-27 Do 13:56] \\
  Saving into a datetree with sufficient number of * produces a proper datetree. I added also the cookie counter to get an overview how many taks I closed on a given day per file.
- Note taken on [2018-05-04 Fr 10:39] \\
  Ideas from Bernt Hansen http://doc.norang.ca/org-mode.html
:END:
- Where my Org files are stored
#+BEGIN_SRC emacs-lisp
  (setq org-directory (concat cloud-dir "org"))
#+END_SRC
- Archiving into a datetree
#+BEGIN_SRC emacs-lisp
  (setq  org-archive-location "archive.org::datetree/*** %S [/]")
#+END_SRC
- Deadlines and due dates are a fact or life
  By default I want to see deadlines in the agenda 30 days before the due date. The
  following setting accomplishes this:
#+begin_src emacs-lisp
  (setq org-deadline-warning-days 30)
#+end_src
- Speed commands
  I keep forgetting what is possible. [[http://notesyoujustmightwanttosave.blogspot.com/2011/12/org-speed-keys.html][*scratch*: Org Speed Keys]] has an overview.
#+BEGIN_SRC emacs-lisp
  (setq  org-fast-tag-selection-single-key 'expert
         org-special-ctrl-a/e t
         org-special-ctrl-k t
         org-use-speed-commands (lambda () (and (looking-at org-outline-regexp) (looking-back "^\\**"))))

#+END_SRC
- Logging and habits
  I want to log state changes and also use the =org-habit= module
#+BEGIN_SRC emacs-lisp
  (setq  org-habit-graph-column 60
         org-log-done 'time
         org-log-into-drawer t
         org-log-redeadline 'time
         org-log-reschedule 'time)
#+END_SRC
- I like indented mode
#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t
        org-src-tab-acts-natively t)
#+END_SRC
- Refiling
#+BEGIN_SRC emacs-lisp
  (setq org-outline-path-complete-in-steps nil
        org-refile-allow-creating-parent-nodes 'confirm
        org-refile-targets '((org-agenda-files :maxlevel . 5) (nil :maxlevel . 5))
        org-refile-use-outline-path 'file)
#+END_SRC
- Exclude DONE state tasks from refile targets. Idea from Nasy's  [[https://emacs.nasy.moe/#orgd0483d2][Emacs Configuration]]
#+begin_src emacs-lisp
  (defun verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets."
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))
  (setq org-refile-target-verify-function 'verify-refile-target)
#+end_src
- I want to be reminded of agenda items
#+BEGIN_SRC emacs-lisp
  (org-agenda-to-appt)
#+END_SRC
- Quickly insert a block of elisp:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" . "src emacs-lisp"))
#+END_SRC
- Use MobileOrg with encryption
#+BEGIN_SRC emacs-lisp
  (setq org-mobile-use-encryption t)
#+END_SRC
- Some alias for =org-mobile-push= and =org-mobile-pull=:
#+begin_src emacs-lisp
  (defalias 'omp 'org-mobile-push)
  (defalias 'omf 'org-mobile-pull)
#+end_src
- Update cookies when killing lines (from [[http://whattheemacsd.com/setup-org.el-01.html][What the .emacs.d!?]])
#+BEGIN_SRC emacs-lisp
  (defun myorg-update-parent-cookie ()
    (when (equal major-mode 'org-mode)
      (save-excursion
        (ignore-errors
          (org-back-to-heading)
          (org-update-parent-todo-statistics)))))

  (defadvice org-kill-line (after fix-cookies activate)
    (myorg-update-parent-cookie))

  (defadvice kill-whole-line (after fix-cookies activate)
    (myorg-update-parent-cookie))
#+END_SRC
- Also update cookies after refiling entries (from [[https://lists.gnu.org/archive/html/emacs-orgmode/2012-01/msg00167.html][Re: {O} refiling tasks and counter cookies]])
#+begin_src emacs-lisp
  (add-hook
   'org-after-refile-insert-hook
    'org-update-parent-todo-statistics)
#+end_src
- Always load these modules
#+BEGIN_SRC emacs-lisp
  (setq org-modules '(org-habit ol-info org-expiry))
#+END_SRC
- Count todo statistics across subtrees
 #+begin_src emacs-lisp
   (setq org-hierarchical-todo-statistics nil)
 #+end_src
- I want duration in hours/minutes rather than days
#+begin_src emacs-lisp
  (setq org-duration-format '((special . h:mm)))
#+end_src
- Follow links by pressing ENTER on them
#+begin_src emacs-lisp
  (setq org-return-follows-link t)
#+end_src
- Adapt indentation
#+begin_src emacs-lisp
  (setq org-adapt-indentation t)
#+end_src
- Fast tag and todo selection
#+begin_src emacs-lisp
  (setq org-fast-todo-selection t
        org-fast-tag-selection-include-todo nil)
#+end_src
- Avoid accidentally editing folded regions, say by adding text after an Org “⋯”.
#+begin_src emacs-lisp
  (setq org-catch-invisible-edits 'show)
#+end_src
- Hide drawers when cycling. Function found at [[https://github.com/codygman/my-emacs-everywhere/blob/master/emacs-config.org][my-emacs-everywhere/emacs-config.org at master · codygman/my-emacs-everywhere...]]
#+begin_src emacs-lisp
  (custom-set-faces
   '(org-drawer ((t (:weight thin :foreground "#586e75"))))
   )
   ;; hide drawers when cycling
  (defun org-cycle-hide-drawers (state)
    "Re-hide all drawers after a visibility state change."
    (when (and (derived-mode-p 'org-mode)
               (not (memq state '(overview folded contents))))
      (save-excursion
        (let* ((globalp (memq state '(contents all)))
               (beg (if globalp
                        (point-min)
                      (point)))
               (end (if globalp
                        (point-max)
                      (if (eq state 'children)
                          (save-excursion
                            (outline-next-heading)
                            (point))
                        (org-end-of-subtree t)))))
          (goto-char beg)
          (while (re-search-forward org-drawer-regexp end t)
            (save-excursion
              (beginning-of-line 1)
              (when (looking-at org-drawer-regexp)
                (let* ((start (1- (match-beginning 0)))
                       (limit
                        (save-excursion
                          (outline-next-heading)
                          (point)))
                       (msg (format
                             (concat
                              "org-cycle-hide-drawers:  "
                              "`:END:`"
                              " line missing at position %s")
                             (1+ start))))
                  (if (re-search-forward "^[ \t]*:END:" limit t)
                      (outline-flag-region start (point-at-eol) t)
                    (user-error msg))))))))))
  (add-hook 'org-cycle-hook 'org-cycle-hide-drawers)
  (add-hook 'org-mode-hook (lambda ()
                             (local-set-key (kbd "C-c s") 'org-show-subtree)))
#+end_src
*** Add a created property to new entries
      :PROPERTIES:
      :CREATED:  [2018-07-09 Mo 23:26]
      :END:
      It's a combination of =org-expiry= and a capture hook. =org-expiry= is loaded
      through =org-modules=.
      #+BEGIN_SRC emacs-lisp
        (use-package org-contrib)
        (require 'org-expiry)
        (org-expiry-insinuate)
        (setq org-expiry-inactive-timestamps t)
        (add-hook 'org-capture-before-finalize-hook
        #'(lambda()
        (save-excursion
        (org-back-to-heading)
        (org-expiry-insert-created))))
      #+END_SRC
*** The usual keybindings
#+begin_src emacs-lisp
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-switchb)
#+end_src
*** Adding =imenu= support
:LOGBOOK:
- Note taken on [2018-07-18 Mi 07:32] \\
  Added setting for =org-imenu-depth=.
- Note taken on [2013-09-04 Mi 12:06] \\
  Found in the manual
:END:
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
(lambda () (imenu-add-to-menubar "Imenu")))
#+end_src
By default only 2 headings deep are shown which isn't enough when using odd levels only.
#+BEGIN_SRC emacs-lisp
(setq org-imenu-depth 5)
#+END_SRC
