my_emacs/emacs.el

(use-package olivetti
  :custom
  (olivetti-body-width 0.8)
  (olivetti-hide-mode-line t)
  )

(setq org-directory (concat cloud-dir "org"))

(setq  org-archive-location "archive.org::datetree/*** %S [/]")

(setq org-deadline-warning-days 30)

(setq  org-fast-tag-selection-single-key 'expert
       org-special-ctrl-a/e t
       org-special-ctrl-k t
       org-use-speed-commands (lambda () (and (looking-at org-outline-regexp) (looking-back "^\\**"))))

(setq  org-habit-graph-column 60
       org-log-done 'time
       org-log-into-drawer t
       org-log-redeadline 'time
       org-log-reschedule 'time)

(setq org-startup-indented t
      org-src-tab-acts-natively t)

(setq org-outline-path-complete-in-steps nil
      org-refile-allow-creating-parent-nodes 'confirm
      org-refile-targets '((org-agenda-files :maxlevel . 5) (nil :maxlevel . 5))
      org-refile-use-outline-path 'file)

(defun verify-refile-target ()
  "Exclude todo keywords with a done state from refile targets."
  (not (member (nth 2 (org-heading-components)) org-done-keywords)))
(setq org-refile-target-verify-function 'verify-refile-target)

(org-agenda-to-appt)

(add-to-list 'org-structure-template-alist
             '("el" . "src emacs-lisp"))

(setq org-mobile-use-encryption t)

(defalias 'omp 'org-mobile-push)
(defalias 'omf 'org-mobile-pull)

(defun myorg-update-parent-cookie ()
  (when (equal major-mode 'org-mode)
    (save-excursion
      (ignore-errors
        (org-back-to-heading)
        (org-update-parent-todo-statistics)))))

(defadvice org-kill-line (after fix-cookies activate)
  (myorg-update-parent-cookie))

(defadvice kill-whole-line (after fix-cookies activate)
  (myorg-update-parent-cookie))

(add-hook
 'org-after-refile-insert-hook
  'org-update-parent-todo-statistics)

(setq org-modules '(org-habit ol-info org-expiry))

(setq org-hierarchical-todo-statistics nil)

(setq org-duration-format '((special . h:mm)))

(setq org-return-follows-link t)

(setq org-adapt-indentation t)

(setq org-fast-todo-selection t
      org-fast-tag-selection-include-todo nil)

(setq org-catch-invisible-edits 'show)

(custom-set-faces
 '(org-drawer ((t (:weight thin :foreground "#586e75"))))
 )
 ;; hide drawers when cycling
(defun org-cycle-hide-drawers (state)
  "Re-hide all drawers after a visibility state change."
  (when (and (derived-mode-p 'org-mode)
             (not (memq state '(overview folded contents))))
    (save-excursion
      (let* ((globalp (memq state '(contents all)))
             (beg (if globalp
                      (point-min)
                    (point)))
             (end (if globalp
                      (point-max)
                    (if (eq state 'children)
                        (save-excursion
                          (outline-next-heading)
                          (point))
                      (org-end-of-subtree t)))))
        (goto-char beg)
        (while (re-search-forward org-drawer-regexp end t)
          (save-excursion
            (beginning-of-line 1)
            (when (looking-at org-drawer-regexp)
              (let* ((start (1- (match-beginning 0)))
                     (limit
                      (save-excursion
                        (outline-next-heading)
                        (point)))
                     (msg (format
                           (concat
                            "org-cycle-hide-drawers:  "
                            "`:END:`"
                            " line missing at position %s")
                           (1+ start))))
                (if (re-search-forward "^[ \t]*:END:" limit t)
                    (outline-flag-region start (point-at-eol) t)
                  (user-error msg))))))))))
(add-hook 'org-cycle-hook 'org-cycle-hide-drawers)
(add-hook 'org-mode-hook (lambda ()
                           (local-set-key (kbd "C-c s") 'org-show-subtree)))

(use-package org-contrib)
(require 'org-expiry)
(org-expiry-insinuate)
(setq org-expiry-inactive-timestamps t)
(add-hook 'org-capture-before-finalize-hook
#'(lambda()
(save-excursion
(org-back-to-heading)
(org-expiry-insert-created))))

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-switchb)

(add-hook 'org-mode-hook
(lambda () (imenu-add-to-menubar "Imenu")))

(setq org-imenu-depth 5)
