my_emacs/emacs.org
*** Agenda settings
      :LOGBOOK:
      - Note taken on [2015-11-08 So 18:54] \\
        LAPTOP as a todo removed because I don't use it any longer
      :END:
      I use a GTD type agenda with all todo keywords and a project list
      The settings for =org-todo-keywords=, =org-stuck-projects= and
      =org-agenda-custom-commands=  are in =local.el= since they are both sensitive and
      system-dependent.
   #+begin_src emacs-lisp
      (setq org-agenda-files (concat org-directory "/agenda.txt")
            org-agenda-date-weekend (quote (:foreground "Yellow" :weight bold))
            org-agenda-start-on-weekday nil
            org-agenda-block-separator 9472
            org-agenda-include-diary t
            org-agenda-insert-diary-extract-time t
            org-agenda-remove-tags t
            org-agenda-show-inherited-tags t
            org-agenda-skip-deadline-if-done t
            org-agenda-skip-deadline-prewarning-if-scheduled (quote pre-scheduled) ;;don't show tasks that are scheduled or have deadlines in the
            org-agenda-skip-scheduled-if-deadline-is-shown t ;;don't give a warning colour to tasks with impending deadlines if they are scheduled to be done
            org-agenda-skip-scheduled-if-done t           org-agenda-skip-scheduled-if-deadline-is-shown t ;;don't give a warning colour to tasks with impending deadlines if they are scheduled to be done
            org-agenda-sorting-strategy ;;sort tasks in order of when they are due and then by priority
            (quote
             ((agenda time-up habit-down deadline-up priority-down category-keep)
              (todo priority-down category-keep)
              (tags priority-down category-keep)
              (search category-keep)))
            org-agenda-time-grid
            (quote
             ((daily today remove-match)
              (800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800)
              "......" "----------------")))
   #+end_src
   Use icons in the agenda
   #+begin_src emacs-lisp
      (setq org-agenda-category-icon-alist
         `(("Org" ,(list (all-the-icons-faicon "check-circle")) nil nil :ascent center)
           ("regularly" ,(list (all-the-icons-faicon "cogs")) nil nil :ascent center)
           ("buecher" ,(list (all-the-icons-faicon "book")) nil nil :ascent center)
           ("Journal" ,(list (all-the-icons-faicon "leanpub")) nil nil :ascent center)
           ("tasks" ,(list (all-the-icons-faicon "check-circle-o")) nil nil :ascent center)
           ("work" ,(list (all-the-icons-faicon "briefcase")) nil nil :ascent center)
           ("tree" ,(list (all-the-icons-faicon "tree")) nil nil :ascent center)
           ("team" ,(list (all-the-icons-faicon "users")) nil nil :ascent center)
           ))
   #+end_src
   I just learned about agenda clockreport. It seems useful to add it to the default agenda view
   #+begin_src emacs-lisp
     (setq org-agenda-start-with-clockreport-mode t
           org-clock-report-include-clocking-task t
           org-agenda-clockreport-parameter-plist
           (quote (:link t :maxlevel 4 :fileskip0 t :compact t :narrow 80)))
   #+end_src
   The clocking table can be hidden and shown with "R".
- I also play with =org-super-agenda=
#+begin_src emacs-lisp
    (use-package org-super-agenda
      :demand t
      :config
      (org-super-agenda-mode))
#+end_src
*** Capture templates
      :LOGBOOK:
      - Note taken on [2018-09-27 Do 11:38] \\
        Separate the capture templates
      - Note taken on [2018-05-20 So 21:47] \\
        I moved several settings form =custom.el= here to use the variables from
        =local.el=
      :END:
      Let's try =doct=.
     #+begin_src emacs-lisp
       (use-package doct
         :ensure t
         ;;recommended: defer until calling doct
         :commands (doct))
      #+end_src
      #+BEGIN_SRC emacs-lisp
        (setq org-capture-templates
              (doct `(
                      (,(format "%s\tCliplink capture task" (all-the-icons-faicon "globe" :face 'all-the-icons-blue :v-adjust 0.01))
                       :keys "c"
                       :file "Inbox.org"
                       :type entry
                       :template ("* %(org-cliplink-capture)")
                       :empty-lines 1)
                      (,(format "%s\tIdeen" (all-the-icons-octicon "file-text" :face 'all-the-icons-cyan :v-adjust 0.01))
                       :keys "i"
                       :file "Inbox.org"
                       :type entry
                       :template ("* %^{Title}
          %i"))
                      (,(format "%s\tJournal" (all-the-icons-faicon "sticky-note-o" :face 'all-the-icons-green :v-adjust 0.01))
                       :keys "j"
                       :file "Journal.org"
                       :datetree t
                       :type entry
                       :template ("* %U %?
          %i"))
                      (,(format "%s\tLog Time" (all-the-icons-material "timer" :face 'all-the-icons-green :v-adjust 0.01))
                       :keys "l"
                       :file "Journal.org"
                       :datetree t
                       :type entry
                       :template ("* %U - %^{Activity}  :TIME:")
                       :immediate-finish t
                       :clock-in t
                       :clock-keep t)
                      (,(format "%s\tOutcomes for today" (all-the-icons-material "today" :face 'all-the-icons-yellow :v-adjust 0.01))
                       :keys "o"
                       :file "Journal.org"
                       :datetree t
                       :type entry
                       :template ("* %U 3 Outcomes for today [%]   :ZIELE:
%[~/.emacs.d/config/org/.woche.txt]"))
                      (,(format "%s\tWeekly Review" (all-the-icons-octicon "inbox" :face 'all-the-icons-yellow :v-adjust 0.01))
                       :keys "r"
                       :file "Journal.org"
                       :datetree t
                       :type entry
                       :template ("* Weekly Review  :PERSOENLICH:
%[~/.emacs.d/config/org/.weeklyreview.txt]"))
                      (,(format "%s\tTasks" (all-the-icons-octicon "checklist" :face 'all-the-icons-yellow :v-adjust 0.01))
                       :keys "t"
                       :file "tasks.org"
                       :headline "Inbox:"
                       :type entry
                       :template ("* TODO %^{Task}
          %i")
                       :immediate-finish t)
                      (,(format "%s\tOutcomes for the week" (all-the-icons-faicon "calendar-check-o" :face 'all-the-icons-yellow :v-adjust 0.01))
                       :keys "w"
                       :file "Journal.org"
                       :datetree t
                       :type entry
                       :template ("* %U 3 Outcomes for the week [%]   :ZIELE:
%[~/.emacs.d/config/org/.woche.txt]"))
                      )
                    )
              )
      #+END_SRC
*** Org-Babel
:LOGBOOK:
      - Note taken on [2018-07-19 Do 18:32] \\
        Set directory for plantuml fitting to no-littering
      - Note taken on [2018-05-14 Mo 21:37] \\
        Added plantuml specific parts
      - Note taken on [2015-09-24 Do 20:13] \\
        no longer works so I comment it out
      - Note taken on [2013-11-02 Sa 22:08] \\
        Added
      :END:
- =ob-plantuml= allows to provide Plantuml diagrams within Orgmode documents. To
  have only the diagram in the output you need to set =:exports results= in the src
  block.
  #+begin_src emacs-lisp
    (setq org-plantuml-jar-path (concat (expand-file-name no-littering-etc-directory) "org/plantuml.jar"))
    (add-to-list
     'org-src-lang-modes '("plantuml" . plantuml))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (plantuml . t)))
   #+end_src
- I don't want to be asked about code evaluation
  #+begin_src emacs-lisp
    (setq org-confirm-babel-evaluate nil)
  #+end_src
- Use syntax highlighting ("fontification") in org-mode source blocks
  #+begin_src emacs-lisp
    (setq org-src-fontify-natively 't)
  #+end_src
- Automatically refresh inline images
  From http://emacs.stackexchange.com/questions/3302/live-refresh-of-inline-images-with-org-display-inline-images
  #+BEGIN_SRC emacs-lisp
    (defun shk-fix-inline-images ()
    (when org-inline-image-overlays
    (org-redisplay-inline-images)))

      (add-hook 'org-babel-after-execute-hook 'shk-fix-inline-images)
      #+END_SRC
