my_emacs/emacs.org
*** Org-Book
It's a nice interface to keep my reading list in Org-Mode. I added code to grab input from Manning since I read a lot of their books.
#+begin_src emacs-lisp
      (use-package org-books
        :custom
         (org-books-url-patterns
         (quote
          ((amazon . "^\\(www\\.\\)?amazon\\.")
           (goodreads . "^\\(www\\.\\)?goodreads\\.com")
           (isbn . "openlibrary\\.org")
           (manning . "^\\(www\\.\\)?manning\\."))))
        :config
        (setq org-books-file (concat cloud-dir "org/books.org"))
    )
  #+end_src
        (defun org-books-get-details-manning (url)
          "Get book details from Manning URL."
          (let* ((page-node (enlive-fetch url))
                 (title (org-books--clean-str (s-join " " (org-books-get-details-manning-title page-node))))
                 (author (org-books--clean-str (nth 2 (org-books-get-details-manning-authors page-node)))))
            (list title author `(("Manning" . ,url)))))

        (defun org-books-get-details-manning-authors (page-node)
          "Return author names for Manning PAGE-NODE.
      PAGE-NODE is the return value of `enlive-fetch' on the page url."
          (mapcar #'enlive-text (enlive-query page-node [.product-authorship])))

        (defun org-books-get-details-manning-title (page-node)
          "return titles for Manning PAGE_NODE.
      PAGE-NODE is the return value of `enlive-fetch' on the page url."
          (mapcar #'enlive-text (enlive-query page-node [.product-title])))

        (defun org-books-get-details (url url-type)
          "Fetch book details from given URL and its URL-TYPE.
      Return a list of three items: title (string), author (string) and
      an alist of properties to be applied to the org entry."
          (cl-case url-type
            (amazon (org-books-get-details-amazon url))
            (goodreads (org-books-get-details-goodreads url))
            (isbn (org-books-get-details-isbn url))
            (manning (org-books-get-details-manning url)))))
#+end_src
*** Org-Export
:LOGBOOK:
- Note taken on [2019-01-01 Di 17:46] \\
  Org 9.2 changes the structure-template semantics. So Iremevied the ox-hugo template
- Note taken on [2018-09-27 Do 11:34] \\
  Move seetings from =custom.el= here
:END:
- Some general settings. I don't need tags or todo keyword in the export and also usually
  no toc. Only headings with certain tags shall be exported
#+BEGIN_SRC emacs-lisp
  (setq org-export-exclude-tags '("NA")
        org-export-select-tags (quote ("PROJEKT" "TOPIC" "EXPORT"))
        org-export-with-tags nil
        org-export-with-toc nil
        org-export-with-todo-keywords nil)
#+END_SRC
- Htmlize is required to fontify Org-export
#+begin_src emacs-lisp
  (use-package htmlize)
#+end_src
- I use =pandoc= for export to various formats
  #+begin_src emacs-lisp
    (setq org-pandoc-menu-entry
          '(
            (?x "to docx and open." org-pandoc-export-to-docx-and-open)
            (?X "to docx." org-pandoc-export-to-docx)
            (?p "to plain and open." org-pandoc-export-to-plain-and-open)
            (?P "as plain." org-pandoc-export-as-plain)
            (?h "to html5 and open." org-pandoc-export-to-html5-and-open)
            (?H "as html5." org-pandoc-export-as-html5)))
    (use-package ox-pandoc
      :after org
;      :config (add-to-list 'org-pandoc-options '(toc . t))
      :demand t)
  #+end_src
  - I use ascii export a lot but want wider text
    #+begin_src emacs-lisp
    (setq org-ascii-text-width 150)
    #+end_src
  - I want to blog using =hugo=
#+BEGIN_SRC emacs-lisp
  (use-package ox-hugo
    :demand t
    :after ox)
#+END_SRC
*** Org-cliplink
Easily insert links form the clipboard in org-mode files
      #+BEGIN_SRC emacs-lisp
      (use-package org-cliplink
      :bind ("C-c p" . org-cliplink))
      #+END_SRC
*** Org-Clock
:PROPERTIES:
:CREATED:  [2018-08-24 Fr 13:43]
:END:
I started again to use clocking in Org-mode. Here are the related settings
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist 'clock
        org-clock-in-resume t
        org-clock-report-include-clocking-task t
        org-clock-mode-line-total 'current
        org-clock-out-remove-zero-time-clocks t
        org-clock-clocked-in-display 'both
        org-agenda-clockreport-parameter-plist '(:link t :maxlevel 3))
  (org-clock-persistence-insinuate)
  #+END_SRC
Clock-tables are useful to get an overview over the time spent. I like to have time sorted
by tags. This is possible with some clever code found here [[https://gist.github.com/ironchicken/6b5424bc2024b3d0a58a8a130f73c2ee][Emacs org-mode dynamic block
similar to clocktable, but grouped by tagSee: ht...]]
 #+begin_src emacs-lisp
(defun clocktable-by-tag/shift-cell (n)
  (let ((str ""))
    (dotimes (i n)
      (setq str (concat str "| ")))
    str))

(defun clocktable-by-tag/insert-tag (params)
  (let ((tag (plist-get params :tags)))
    (insert "|--\n")
    (insert (format "| %s | *Tag time* |\n" tag))
    (let ((total 0))
      (mapcar
       (lambda (file)
         (let ((clock-data (with-current-buffer (find-file-noselect file)
                             (org-clock-get-table-data (buffer-name) params))))
           (when (> (nth 1 clock-data) 0)
             (setq total (+ total (nth 1 clock-data)))
             (insert (format "| | File *%s* | %.2f |\n"
                             (file-name-nondirectory file)
                             (/ (nth 1 clock-data) 60.0)))
             (dolist (entry (nth 2 clock-data))
               (insert (format "| | . %s%s | %s %.2f |\n"
                               (org-clocktable-indent-string (nth 0 entry))
                               (nth 1 entry)
                               (clocktable-by-tag/shift-cell (nth 0 entry))
                               (/ (nth 4 entry) 60.0)))))))
       (org-agenda-files))
      (save-excursion
        (re-search-backward "*Tag time*")
        (org-table-next-field)
        (org-table-blank-field)
        (insert (format "*%.2f*" (/ total 60.0)))))
    (org-table-align)))

(defun org-dblock-write:clocktable-by-tag (params)
  (insert "| Tag | Headline | Time (h) |\n")
  (insert "|     |          | <r>  |\n")
  (let ((tags (plist-get params :tags)))
    (mapcar (lambda (tag)
              (clocktable-by-tag/insert-tag (plist-put (plist-put params :match tag) :tags tag)))
            tags)))
#+end_src
*** Org-Download
:PROPERTIES:
:CREATED:  [2020-05-17 So 13:29]
:END:
Allows to download and insert images in org-buffers
#+begin_src emacs-lisp
(use-package org-download
  :bind ("C-c i" . org-download-yank)
  :hook (org-mode . org-download-enable)
  :config
  (setq org-download-method 'attach))
#+end_src
*** Additional link type for TAGS
      :LOGBOOK:
      - Note taken on [2018-05-19 Sa 18:55] \\
        From http://endlessparentheses.com/use-org-mode-links-for-absolutely-anything.html
      :END:
      The following code defines links which search your headlines for specific tags.
#+BEGIN_SRC emacs-lisp
  (org-add-link-type
   "tag" 'endless/follow-tag-link)

  (defun endless/follow-tag-link (tag)
    "Display a list of TODO headlines with tag TAG.
  With prefix argument, also display headlines without a TODO keyword."
    (org-tags-view (null current-prefix-arg) tag))
#+END_SRC

Then, merely write your links as =[[tag:work+phonenumber-boss][Optional Description]\]=q
*** Toc-Org
Table of contents in Org Files. After the installation, every time I'm saving an org
file, the first headline with a :TOC: tag will be updated with the current table of
contents.
#+BEGIN_SRC emacs-lisp
  (use-package toc-org
    :ensure t
    :after org
    :hook (org-mode . toc-org-enable))
#+END_SRC
