my_emacs/emacs.el

(use-package org-books
    :custom
     (org-books-url-patterns
     (quote
      ((amazon . "^\\(www\\.\\)?amazon\\.")
       (goodreads . "^\\(www\\.\\)?goodreads\\.com")
       (isbn . "openlibrary\\.org")
       (manning . "^\\(www\\.\\)?manning\\."))))
    :config
    (setq org-books-file (concat cloud-dir "org/books.org"))
)

(setq org-export-exclude-tags '("NA")
      org-export-select-tags (quote ("PROJEKT" "TOPIC" "EXPORT"))
      org-export-with-tags nil
      org-export-with-toc nil
      org-export-with-todo-keywords nil)

(use-package htmlize)

(setq org-pandoc-menu-entry
          '(
            (?x "to docx and open." org-pandoc-export-to-docx-and-open)
            (?X "to docx." org-pandoc-export-to-docx)
            (?p "to plain and open." org-pandoc-export-to-plain-and-open)
            (?P "as plain." org-pandoc-export-as-plain)
            (?h "to html5 and open." org-pandoc-export-to-html5-and-open)
            (?H "as html5." org-pandoc-export-as-html5)))
    (use-package ox-pandoc
      :after org
;      :config (add-to-list 'org-pandoc-options '(toc . t))
      :demand t)

(setq org-ascii-text-width 150)

(use-package ox-hugo
  :demand t
  :after ox)

(use-package org-cliplink
:bind ("C-c p" . org-cliplink))

(setq org-clock-persist 'clock
      org-clock-in-resume t
      org-clock-report-include-clocking-task t
      org-clock-mode-line-total 'current
      org-clock-out-remove-zero-time-clocks t
      org-clock-clocked-in-display 'both
      org-agenda-clockreport-parameter-plist '(:link t :maxlevel 3))
(org-clock-persistence-insinuate)

(defun clocktable-by-tag/shift-cell (n)
  (let ((str ""))
    (dotimes (i n)
      (setq str (concat str "| ")))
    str))

(defun clocktable-by-tag/insert-tag (params)
  (let ((tag (plist-get params :tags)))
    (insert "|--\n")
    (insert (format "| %s | *Tag time* |\n" tag))
    (let ((total 0))
      (mapcar
       (lambda (file)
         (let ((clock-data (with-current-buffer (find-file-noselect file)
                             (org-clock-get-table-data (buffer-name) params))))
           (when (> (nth 1 clock-data) 0)
             (setq total (+ total (nth 1 clock-data)))
             (insert (format "| | File *%s* | %.2f |\n"
                             (file-name-nondirectory file)
                             (/ (nth 1 clock-data) 60.0)))
             (dolist (entry (nth 2 clock-data))
               (insert (format "| | . %s%s | %s %.2f |\n"
                               (org-clocktable-indent-string (nth 0 entry))
                               (nth 1 entry)
                               (clocktable-by-tag/shift-cell (nth 0 entry))
                               (/ (nth 4 entry) 60.0)))))))
       (org-agenda-files))
      (save-excursion
        (re-search-backward "*Tag time*")
        (org-table-next-field)
        (org-table-blank-field)
        (insert (format "*%.2f*" (/ total 60.0)))))
    (org-table-align)))

(defun org-dblock-write:clocktable-by-tag (params)
  (insert "| Tag | Headline | Time (h) |\n")
  (insert "|     |          | <r>  |\n")
  (let ((tags (plist-get params :tags)))
    (mapcar (lambda (tag)
              (clocktable-by-tag/insert-tag (plist-put (plist-put params :match tag) :tags tag)))
            tags)))

(use-package org-download
  :bind ("C-c i" . org-download-yank)
  :hook (org-mode . org-download-enable)
  :config
  (setq org-download-method 'attach))

(org-add-link-type
 "tag" 'endless/follow-tag-link)

(defun endless/follow-tag-link (tag)
  "Display a list of TODO headlines with tag TAG.
With prefix argument, also display headlines without a TODO keyword."
  (org-tags-view (null current-prefix-arg) tag))

(use-package toc-org
  :ensure t
  :after org
  :hook (org-mode . toc-org-enable))

(add-hook 'org-mode-hook
          (lambda ()
