my_emacs/emacs.org
*** Org Beautify
:PROPERTIES:
:CREATED:  [2018-08-18 Sa 22:00]
:END:
Settings to make org buffers look nicer
- I like =visual-pitch-mode and =visual-line-mode= for org files.
  #+BEGIN_SRC emacs-lisp
    (add-hook 'org-mode-hook
              (lambda ()
                (variable-pitch-mode 1)
                visual-line-mode))
  #+END_SRC
- Hiding stars and no emphasis markers displayed
  #+BEGIN_SRC emacs-lisp
    (setq org-hide-emphasis-markers t
          org-fontify-done-headline t
          org-ellipsis "⤵"
          org-pretty-entities t
          org-pretty-entities-include-sub-superscripts nil)
  #+END_SRC
- Automatically change list bullets and indent
  #+begin_src emacs-lisp
    (setq org-list-demote-modify-bullet
          (quote (("-" . "+")
                  ("+" . "*")
                  ("1." . "-")
                  ("1)" . "-")
                  ("A)" . "-")
                  ("B)" . "-")
                  ("a)" . "-")
                  ("b)" . "-")
                  ("A." . "-")
                  ("B." . "-")
                  ("a." . "-")
                  ("b." . "-")))
          org-list-indent-offset 2)
   #+end_src
- Nice looking bullets
#+begin_src emacs-lisp
  (use-package org-superstar
    :custom
    (org-superstar-headline-bullets-list '("◉" "◎" "○" "►" "◇"))
    (org-superstar-item-bullet-alist '((?- . ?•) (?+ . ?➤) (?* . ?◦)))
  :config
  (setq org-superstar-cycle-headline-bullets t
        org-superstar-special-todo-items nil
        org-superstar-prettify-item-bullets t)
  :hook (org-mode . org-superstar-mode))
#+end_src
- Prettify src blocks
  Inspired by a comment in [[https://www.reddit.com/r/emacs/comments/9lpupc/i_use_markdown_rather_than_orgmode_for_my_notes/][i use markdown rather than org-mode for my notes : emacs]] I
  looked at the now builtin mode =prettify-symbols-mode=.. The configuration follows the
  example given in [[http://endlessparentheses.com/new-in-emacs-25-1-have-prettify-symbols-mode-reveal-the-symbol-at-point.html][New in Emacs 25.1: Have prettify-symbols-mode reveal the symbol at point · En...]].
  #+BEGIN_SRC emacs-lisp
    (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "✎")
                                           ("#+END_SRC" . "□")
                                           ("#+begin_src" . "✎")
                                           ("#+end_src" . "□")
                                           (">=" . "≥")
                                           ("=>" . "⇨")
                                           ("[ ]" .  "☐")
                                           ("[X]" . "☑")
                                           ("[-]" . "?⛞" )
                                           ("#+TITLE" . "🕮")
                                           ("#+DATE" . "📆")
                                           ("#+AUTHOR" . "👤")
                                           ("#+COLUMNS" . "▓")
                                           ("#+EMAIL" . "🖂")
                                           ("#+OPTIONS" . ?⚙)
                                           ("#+TYP_TODO" . "☑")
                                           ("#+TAGS" . ?🏷)
                                           ("#+EXPORT_SELECT_TAGS" . ?🏷)
                                           ("#+EXPORT_EXCLUDE_TAGS" . ?🏷)
                                           ("#+DESCRIPTION" . ?🗎)))
    (setq prettify-symbols-unprettify-at-point 'right-edge)
    (add-hook 'org-mode-hook 'prettify-symbols-mode)
  #+END_SRC
- Strike through done checkboxes is also nice copied from [[https://jft.rocks/emacs/use-unicode-symbol-to-display-org-mode-checkboxes][JFT&#x27;s Notes - Use unicode symbol to display org-mode checkboxes]]
#+begin_src emacs-lisp
(defface org-checkbox-done-text
  '((t (:foreground "#71696A" :strike-through t)))
  "Face for the text part of a checked org-mode checkbox.")

(font-lock-add-keywords
 'org-mode
 `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)"
    1 'org-checkbox-done-text prepend))
 'append)
#+end_src
- Some font setting for fixed-pitch
#+begin_src emacs-lisp
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (add-to-list 'org-emphasis-alist
               '("*" (:weight bold)))
#+end_src

- Use pretty-tags
#+begin_src emacs-lisp
  (use-package org-pretty-tags
    :demand t
    :config
     (setq org-pretty-tags-surrogate-strings
           (quote
            (("TOPIC" . "☆")
             ("PROJEKT" . "💡")
             ("SERVICE" . "✍")
             ("Blog" . "✍")
             ("music" . "♬")
             ("security" . "🔥"))))
     (org-pretty-tags-global-mode))
#+end_src
- Use Fancy priorities
#+begin_src emacs-lisp
  (use-package org-fancy-priorities
    :diminish
    :demand t
    :defines org-fancy-priorities-list
    :hook (org-mode . org-fancy-priorities-mode)
    :config
    (unless (char-displayable-p ?❗)
      (setq org-fancy-priorities-list '("HIGH" "MID" "LOW" "OPTIONAL"))))
#+end_src
*** Org Outline numbering
:PROPERTIES:
:CREATED:  [2018-10-25 Do 20:36]
:END:
:LOGBOOK:
- Note taken on [2018-12-02 So 19:59] \\
  =org-num= seems more reliable and will be part of org-mode in the future
:END:
Display an outline numbering as overlays on Org mode headlines. The numbering matches how
it would appear when exporting the org file.
#+BEGIN_SRC emacs-lisp
  (use-package org-num
    :ensure nil
    :after org
    :hook (org-mode . org-num-mode))
#+END_SRC
*** Org-Kanban
:PROPERTIES:
:CREATED:  [2019-07-26 Fr 22:19]
:END:
Sometimes Kanban boards are useful
#+begin_src emacs-lisp
(use-package org-kanban)
#+end_src
*** Org-Sidebar
      :PROPERTIES:
      :CREATED:  [2019-11-06 Mi 21:54]
      :END:
      A nice addition from [[https://github.com/alphapapa/alpha-org/][GitHub - alphapapa/alpha-org: A powerful Org configuration]]
#+begin_src emacs-lisp
  (use-package org-sidebar
    :custom (org-sidebar-tree-side 'left)
    (org-sidebar-tree-jump-fn 'org-sidebar-tree-jump-source))
#+end_src
*** Org-Noter
:PROPERTIES:
:CREATED:  [2020-01-14 Tue 17:44]
:END:
This package makes it easy to add annotations and comments to PDF files.
#+begin_src emacs-lisp
(use-package org-noter)
#+end_src
** PDF Tools
:PROPERTIES:
:CREATED:  [2020-01-14 Tue 17:43]
:END:
This is an awesome package to read an annotate PDF files. Now it even works on Windows.
#+begin_src emacs-lisp
(use-package pdf-tools
  :pin MELPA
  :config
  (pdf-tools-install :no-query))
#+end_src
*** Org-Noter
:PROPERTIES:
:CREATED:  [2020-01-14 Tue 17:44]
:END:
This package makes it easy to add annotations and comments to PDF files.
#+begin_src emacs-lisp
(use-package org-noter)
#+end_src
** PDF Tools
:PROPERTIES:
:CREATED:  [2020-01-14 Tue 17:43]
:END:
This is an awesome package to read an annotate PDF files. Now it even works on Windows.
#+begin_src emacs-lisp
(use-package pdf-tools
  :pin MELPA
  :config
  (pdf-tools-install :no-query))
#+end_src
** Todo-txt
    :LOGBOOK:
    - Note taken on [2019-10-06 So 18:37] \\
      I don't use it currently
    - Note taken on [2018-06-04 Mo 22:16] \\
      Switched from todotxt to todotxt-mode. The former didn't work as expected and
      destroyed my todo-File
    - Note taken on [2016-12-11 So 11:52] \\
      Added
    :END:
    I switched from Google Tasks to todo.txt and will use Emacs on the PC for it.
    #+begin_src emacs-lisp
      (use-package todotxt-mode
        :demand t
        :disabled
        :config (setq todotxt-default-file (expand-file-name (concat cloud-dir "Todo/todo.txt"))
                      todotxt-default-archive-file (expand-file-name (concat cloud-dir "Todo/done.txt")))
        :bind ("C-c t" . todotxt-add-todo)
        ("C-c o" . todotxt-open-file))
    #+end_src
    Usage:

    TAB             dabbrev-expand
    x               todotxt-insert-x-maybe-complete

    C-c C-a         todotxt-send-to-reminders
    C-c C-d         todotxt-group-by-date
    C-c C-f         Prefix Command
    C-c C-p         todotxt-group-by-project
    C-c C-s         Prefix Command
    C-c C-t         todotxt-group-by-tag
    C-c a           todotxt-pri-a
    C-c b           todotxt-pri-b
    C-c c           todotxt-pri-c
    C-c d           todotxt-toggle-done
    C-c n           todotxt-nopri
    C-c p           todotxt-pri
    C-c t           todotxt-add-todo

    C-c C-s d       todotxt-sort-by-status
    C-c C-s n       todotxt-sort-by-creation-date
    C-c C-s p       todotxt-sort-by-project

    C-c C-f -       todotxt-clear-filter
    C-c C-f @       todotxt-filter-by-person
    C-c C-f d       todotxt-filter-by-status
    C-c C-f p       todotxt-filter-by-project
    C-c C-f t       todotxt-filter-by-tag
** ZTree
:PROPERTIES:
:CREATED:  [2019-05-12 So 16:34]
:END:
A nice directory diff tool
#+begin_src emacs-lisp
(use-package ztree)
#+end_src
* Programming
** JS2 Mode
    :LOGBOOK:
    - Note taken on [2015-04-12 So 16:23] \\
      Added for Javascript editing
    :END:
    According to Emacswiki =JS2-mode= is an improvement over js.
  #+begin_src emacs-lisp
    (use-package js2-mode
    :config (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    )
  #+end_src
** LESS-CSS
    :LOGBOOK:
    - Note taken on [2018-02-26 Mo 22:51] \\
        No longer needed
    :END:
    I use it as part of bones development.
    #+begin_src emacs-lisp
    ;(require 'less-css-mode)
    #+end_src
** Magit
:PROPERTIES:
:CREATED:  [2018-09-29 Sa 17:40]
:END:
Everyone recommends magit so I'll try it. It requires a little tweaking to work with SSH
at least on Windows see https://github.com/magit/magit/wiki/Pushing-with-Magit-from-Windows.
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind (("C-x g" . magit-status))
    :config
    (setq magit-diff-use-overlays nil))

  (cond ((eq system-type 'windows-nt)
         (use-package ssh-agency)
         (setenv "SSH_ASKPASS" "git-gui--askpass")))
#+END_SRC
** PHP Mode
    #+begin_src emacs-lisp
      (use-package php-mode
        :hook (php-mode . (lambda () (define-abbrev php-mode-abbrev-table "ex" "extends"))))
    #+end_src

    To use abbrev-mode, add lines like this:
    (add-hook 'php-mode-hook
        '(lambda () (define-abbrev php-mode-abbrev-table "ex" "extends")))
** Plantuml
    Great tool to create UML and other diagrams.
    #+begin_src emacs-lisp
    (use-package plantuml-mode
    :config (setq plantuml-output-type "png")
    :mode ("\\.puml\\'" . plantuml-mode))
    #+end_src
** Powershell
:PROPERTIES:
:CREATED:  [2019-03-19 Tue 09:06]
:END:
:LOGBOOK:
- Note taken on [2020-01-25 Sa 19:33] \\
  I removed MELPA stable. pin is no longer needed
:END:
I started to do some powerhsell scripting again. The combined file is nice.
 #+begin_src emacs-lisp
   (use-package powershell)
 #+end_src
