my_emacs/emacs.el
            (variable-pitch-mode 1)
            visual-line-mode))

(setq org-hide-emphasis-markers t
      org-fontify-done-headline t
      org-ellipsis "⤵"
      org-pretty-entities t
      org-pretty-entities-include-sub-superscripts nil)

(setq org-list-demote-modify-bullet
      (quote (("-" . "+")
              ("+" . "*")
              ("1." . "-")
              ("1)" . "-")
              ("A)" . "-")
              ("B)" . "-")
              ("a)" . "-")
              ("b)" . "-")
              ("A." . "-")
              ("B." . "-")
              ("a." . "-")
              ("b." . "-")))
      org-list-indent-offset 2)

(use-package org-superstar
  :custom
  (org-superstar-headline-bullets-list '("◉" "◎" "○" "►" "◇"))
  (org-superstar-item-bullet-alist '((?- . ?•) (?+ . ?➤) (?* . ?◦)))
:config
(setq org-superstar-cycle-headline-bullets t
      org-superstar-special-todo-items nil
      org-superstar-prettify-item-bullets t)
:hook (org-mode . org-superstar-mode))

(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "✎")
                                       ("#+END_SRC" . "□")
                                       ("#+begin_src" . "✎")
                                       ("#+end_src" . "□")
                                       (">=" . "≥")
                                       ("=>" . "⇨")
                                       ("[ ]" .  "☐")
                                       ("[X]" . "☑")
                                       ("[-]" . "?⛞" )
                                       ("#+TITLE" . "🕮")
                                       ("#+DATE" . "📆")
                                       ("#+AUTHOR" . "👤")
                                       ("#+COLUMNS" . "▓")
                                       ("#+EMAIL" . "🖂")
                                       ("#+OPTIONS" . ?⚙)
                                       ("#+TYP_TODO" . "☑")
                                       ("#+TAGS" . ?🏷)
                                       ("#+EXPORT_SELECT_TAGS" . ?🏷)
                                       ("#+EXPORT_EXCLUDE_TAGS" . ?🏷)
                                       ("#+DESCRIPTION" . ?🗎)))
(setq prettify-symbols-unprettify-at-point 'right-edge)
(add-hook 'org-mode-hook 'prettify-symbols-mode)

(defface org-checkbox-done-text
  '((t (:foreground "#71696A" :strike-through t)))
  "Face for the text part of a checked org-mode checkbox.")

(font-lock-add-keywords
 'org-mode
 `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)"
    1 'org-checkbox-done-text prepend))
 'append)

(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(add-to-list 'org-emphasis-alist
             '("*" (:weight bold)))

(use-package org-pretty-tags
  :demand t
  :config
   (setq org-pretty-tags-surrogate-strings
         (quote
          (("TOPIC" . "☆")
           ("PROJEKT" . "💡")
           ("SERVICE" . "✍")
           ("Blog" . "✍")
           ("music" . "♬")
           ("security" . "🔥"))))
   (org-pretty-tags-global-mode))

(use-package org-fancy-priorities
  :diminish
  :demand t
  :defines org-fancy-priorities-list
  :hook (org-mode . org-fancy-priorities-mode)
  :config
  (unless (char-displayable-p ?❗)
    (setq org-fancy-priorities-list '("HIGH" "MID" "LOW" "OPTIONAL"))))

(use-package org-num
  :ensure nil
  :after org
  :hook (org-mode . org-num-mode))

(use-package org-kanban)

(use-package org-sidebar
  :custom (org-sidebar-tree-side 'left)
  (org-sidebar-tree-jump-fn 'org-sidebar-tree-jump-source))

(use-package org-noter)

(use-package pdf-tools
  :pin MELPA
  :config
  (pdf-tools-install :no-query))

(use-package org-noter)

(use-package pdf-tools
  :pin MELPA
  :config
  (pdf-tools-install :no-query))

(use-package todotxt-mode
  :demand t
  :disabled
  :config (setq todotxt-default-file (expand-file-name (concat cloud-dir "Todo/todo.txt"))
                todotxt-default-archive-file (expand-file-name (concat cloud-dir "Todo/done.txt")))
  :bind ("C-c t" . todotxt-add-todo)
  ("C-c o" . todotxt-open-file))

(use-package ztree)

(use-package js2-mode
:config (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
)

;(require 'less-css-mode)

(use-package magit
  :bind (("C-x g" . magit-status))
  :config
  (setq magit-diff-use-overlays nil))

(cond ((eq system-type 'windows-nt)
       (use-package ssh-agency)
       (setenv "SSH_ASKPASS" "git-gui--askpass")))

(use-package php-mode
  :hook (php-mode . (lambda () (define-abbrev php-mode-abbrev-table "ex" "extends"))))

(use-package plantuml-mode
:config (setq plantuml-output-type "png")
:mode ("\\.puml\\'" . plantuml-mode))

(use-package powershell)
