my_emacs/emacs.org
** Python
:PROPERTIES:
:CREATED:  [2019-07-07 So 20:51]
:END:
I need to do some python programming so I need to have it in Emacs. The config follows [[https://realpython.com/emacs-the-best-python-editor/][Emacs – The Best Python Editor? – Real Python]]

#+begin_src emacs-lisp
(use-package elpy
  :ensure t
  :defer t
  :init
  (advice-add 'python-mode :before 'elpy-enable))
#+end_src
I want syntax checking as well with flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :config
    (setq elpy-modules (delq 'elpy-module-flymake elpy-modules)
          flycheck-flake8-maximum-line-length 130)
    :hook
    (elpy-mode . flycheck-mode))
#+end_src
and PEP8 compliance
#+begin_src emacs-lisp
  (use-package py-autopep8
    :hook
    (elpy-mode . py-autopep8-enable-on-save)
    )
#+end_src
** Rainbow delimiters mode
:LOGBOOK:
- Note taken on [2018-09-28 Fr 18:55] \\
  rainbow-mode itself doesn't work and ins't useful for me. I removed it
- Note taken on [2018-09-28 Fr 18:42] \\
  rainbow-delimiters need to be activated for prog-modes
- Note taken on [2018-05-13 So 21:13] \\
  Added from http://www.star.bris.ac.uk/bjm/emacs.html
:END:
    Can be useful to check brackets etc.
    #+begin_src emacs-lisp
      (use-package rainbow-delimiters
        :init
        (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
    #+end_src
** Web Mode
    =web-mode.el= is an autonomous emacs major-mode for editing web templates:
    HTML documents embedding parts (CSS / JavaScript) and blocks (client / server side). I
    also use it for editing plain HTML files.
    #+begin_src emacs-lisp
    (use-package web-mode
    :mode (("\\.handlebars\\'" . web-mode) ("\\.html?\\'" . web-mode))
    )
    #+end_src
* Some useful functions and advice
** Advices for =kill-ring-save= and =kill-region=
    #+begin_src emacs-lisp
      (defadvice kill-ring-save (before slick-copy activate compile)
      "When called interactively with no active region, copy a single
      line instead."
      (interactive (if mark-active (list (region-beginning) (region-end)) (message
      "Copied line") (list (line-beginning-position) (line-beginning-position
      2)))))

      (defadvice kill-region (before slick-cut activate compile)
      "When called interactively with no active region, kill a single line instead."
      (interactive
        (if mark-active (list (region-beginning) (region-end))
          (list (line-beginning-position)
            (line-beginning-position 2)))))
    #+end_src
** Use Ido to open recent files
:LOGBOOK:
- Note taken on [2018-09-30 So 20:45] \\
  I'll try ivy/counsel instead for now. The keybinding is set via use-package for counsel
:END:
    #+begin_src emacs-lisp
      (defun ido-recentf-open ()
        "Use `ido-completing-read' to \\[find-file] a recent file"
        (interactive)
        (if (find-file (ido-completing-read "Find recent file: " recentf-list))
            (message "Opening file...")
          (message "Aborting")))

 ;    (global-set-key "\C-x\C-r" 'ido-recentf-open)
    #+end_src
** Don't ask if a buffer visits a running process during killing emacs. =remq= removes the relevant function
    :LOGBOOK:
    - Note taken on [2013-07-13 Sa 20:11] \\
      Added
    :END:
    #+begin_src emacs-lisp
    (setq kill-buffer-query-functions
    (remq 'process-kill-buffer-query-function
    kill-buffer-query-functions))
    #+end_src
** Insert date
    :LOGBOOK:
    - Note taken on [2018-04-29 So 20:30] \\
      Added and changed key C-c d from deft to insert-date
    :END:
    #+begin_src emacs-lisp
    (defun insert-date (prefix)
    "Insert the current date. With prefix-argument, use ISO format. With
    two prefix arguments, add time."
    (interactive "P")
    (let ((format (cond
    ((not prefix) "%x")
    ((equal prefix '(4)) "%F")
    ((equal prefix '(16)) "%F %R"))))
    (insert (format-time-string format))))

    (global-set-key (kbd "C-c d") 'insert-date)
    #+end_src
** Unsplit-line
:PROPERTIES:
:CREATED:  [2018-10-25 Do 21:17]
:END:
Useful function to join lines from [[http://whattheemacsd.com/key-bindings.el-03.html][What the .emacs.d!?]]
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-j")
                (lambda ()
                  (interactive)
                  (join-line -1)))
#+END_SRC
** Toggle between horizontal and vertical window split
:PROPERTIES:
:CREATED:  [2018-10-25 Do 21:19]
:END:
Also from [[http://whattheemacsd.com/buffer-defuns.el-03.html][What the .emacs.d!?]]
#+BEGIN_SRC emacs-lisp
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))
#+END_SRC
** Smarter navigation to the beginning of a line
:PROPERTIES:
:CREATED:  [2020-05-29 Fri 18:47]
:END:
A nice addition from http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/
#+begin_src emacs-lisp
(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
(global-set-key [remap move-beginning-of-line]
                'smarter-move-beginning-of-line)
#+end_src
